{
  "class_names": [
    "AdvancedAnalysisError",
    "AdvancedAnalyzer",
    "AnalysisOptions",
    "ApiLog",
    "AppConfig",
    "BaseEntity",
    "BaseItemSearchPaneDto",
    "BasePaginationDto",
    "BaseSearchPaneParamClass",
    "BatchAnalysisResult",
    "BsnLineDto",
    "ChngDataListL",
    "ChunkBuilder",
    "ChunkType",
    "CommonOrdrUtil",
    "CommonUtil",
    "ConditionAnalysisError",
    "ConditionAnalyzer",
    "ConditionIssue",
    "ConditionTree",
    "ConfigManager",
    "ConfigurationError",
    "CookieUtil",
    "CountTargetResDto",
    "CreateEntityReqDto",
    "CtgrNodeEntity",
    "CtgrTabEntity",
    "CustomTemplateManager",
    "CustomValidationExcelEntity",
    "DataTypeError",
    "DateFormatUtil",
    "DateUtil",
    "DcTrgtDto",
    "DetailLevel",
    "DsbdItemStatEntity",
    "DsbdListViewEntity",
    "DsbdMonthlyOfferEntity",
    "DsbdMonthlyUserGroupOfferEntity",
    "DsbdOfferSubCntEntity",
    "DsbdRecentlyWorkEntity",
    "DsbdUserSetEntity",
    "DsbdViewEntity",
    "DsbdViewPstEntity",
    "EnglishTemplates",
    "EntityItemRelResDto",
    "EntityObjRelResDto",
    "EntityScopeDto",
    "ExcelCellStyleSupport",
    "ExcelCellStyleSupportCustom",
    "ExcelHelperImpl",
    "ExcelInput",
    "ExcelReader",
    "ExcelWriter",
    "FieldAnalysis",
    "FileUtil",
    "FormattingOptionValidator",
    "FormattingOptions",
    "GroupDetailResDto",
    "HTTPStreamingProtocol",
    "ImpactAnalysisResponseDto",
    "IssueDetectionError",
    "IssueDetector",
    "ItemDto",
    "ItemOffrResDto",
    "JSONProcessingError",
    "KoreanTemplates",
    "Language",
    "LanguageDetector",
    "LanguageSupport",
    "LogicError",
    "LogicFlow",
    "MetricsGenerator",
    "MiddleItemEntity",
    "MultiEntityAdditionalDto",
    "MultiEntityDto",
    "MultiLangLabelEntity",
    "MyBatisCommonDao",
    "MyBatisConfig",
    "OfferDpdcRelDto",
    "OffrDpdcReqDto",
    "OffrGrpResDto",
    "PatternUtil",
    "PerformanceMetrics",
    "ProdApplication",
    "ProdCstcRelDDto",
    "ProdDpndRelDDto",
    "ProductStructureDownloadDto",
    "ProductStructureDto",
    "ProgressTracker",
    "QualityMetrics",
    "QualityThresholds",
    "RelationController",
    "RelationGridViewDto",
    "RelationGridViewEntity",
    "RelationGridViewExportDto",
    "RelationGridViewSearchDto",
    "RelationService",
    "RelationViewReqDto",
    "RelationViewResDto",
    "ReportMetadata",
    "RestTemplateConfig",
    "Rule",
    "RuleAnalyzer",
    "RuleAnalyzerError",
    "RuleCondition",
    "RuleJsonInput",
    "RuleJsonOutput",
    "RuleJsonProcessor",
    "RuleParser",
    "RuleParsingError",
    "S3TemplateUtil",
    "SSEProtocol",
    "SaleCpnyDto",
    "SaveEntityObjRelReqDto",
    "SaveTargetReqDto",
    "SearchGroupReqDto",
    "SearchItemRelationReq",
    "SearchMultiEntityReqDto",
    "SearchRelationReqDto",
    "StreamGenerator",
    "StreamManager",
    "StreamingChunk",
    "StreamingFormatter",
    "StreamingOptions",
    "StreamingSession",
    "StreamingStatus",
    "StringUtilCustom",
    "StructureInfo",
    "SwaggerConfig",
    "TargetReqDto",
    "TargetResDto",
    "TextFormatter",
    "TomcatRelaxedCharsCustomizer",
    "UIExtendsController",
    "UIExtendsService",
    "UIImpactAnalysisController",
    "UIMultiEntityController",
    "UIMultiEntityService",
    "UIRelationController",
    "UIRelationService",
    "UiImpactAnalysisService",
    "UserPocketCustomEntity",
    "UserPocketEntity",
    "UuidUtil",
    "ValidationError",
    "ValidationHelper",
    "ValidationResult",
    "WebConfig",
    "WebSocketConfig"
  ],
  "method_names": [
    "__init__",
    "_add_detailed_fields",
    "_add_emojis_to_lines",
    "_analyze_batch_rules",
    "_analyze_batch_rules_async",
    "_analyze_conditions",
    "_analyze_fields",
    "_analyze_logic_flow",
    "_analyze_original_structure",
    "_analyze_performance",
    "_analyze_single_rule",
    "_analyze_single_rule_async",
    "_analyze_structure",
    "_apply_template",
    "_apply_template_variations",
    "_calculate_branch_coverage",
    "_calculate_completeness_score",
    "_calculate_complexity",
    "_calculate_complexity_score",
    "_calculate_consistency_score",
    "_calculate_depth",
    "_calculate_field_complexity",
    "_calculate_final_statistics",
    "_calculate_maintainability_score",
    "_calculate_performance_metrics",
    "_calculate_readability_score",
    "_calculate_values_range",
    "_check_contradiction",
    "_check_number_field_ambiguity",
    "_check_number_field_missing_ranges",
    "_check_redundant_pattern",
    "_check_string_field_ambiguity",
    "_compare_non_numeric",
    "_complete_session",
    "_convert_value_by_type",
    "_count_all_conditions",
    "_count_field_conditions",
    "_count_issues_by_type",
    "_count_logical_operators",
    "_count_total_conditions",
    "_create_basic_info_chunk",
    "_create_completion_chunk",
    "_create_condition_signature",
    "_create_error_chunk",
    "_create_error_response",
    "_create_header_chunk",
    "_create_issue_chunk",
    "_create_issues_chunks",
    "_create_performance_chunk",
    "_create_quality_chunk",
    "_create_report_metadata",
    "_create_structure_chunk",
    "_detect_field_missing_edge_cases",
    "_detect_field_redundant_conditions",
    "_detect_issues",
    "_detect_issues_async",
    "_detect_potential_dead_code",
    "_determine_field_type",
    "_dict_to_text",
    "_evaluate_quality_metrics",
    "_extract_condition_details",
    "_extract_conditions_from_tree",
    "_extract_field_conditions_recursive",
    "_extract_unique_fields",
    "_filter_simple_fields",
    "_format_chunk",
    "_format_error",
    "_format_error_event",
    "_format_progress",
    "_format_progress_event",
    "_format_sse_event",
    "_generate_optimization_suggestions",
    "_generate_summary",
    "_get_average_processing_time",
    "_get_condition_field",
    "_get_condition_uuid",
    "_get_current_timestamp",
    "_get_detailed_template",
    "_get_disp_name",
    "_get_normal_template",
    "_get_simple_template",
    "_get_timestamp",
    "_get_total_items",
    "_get_validation_result_for_session",
    "_heartbeat_loop",
    "_identify_bottleneck_conditions",
    "_infer_type_from_value",
    "_is_date_string",
    "_is_numeric_value",
    "_merge_config",
    "_parse_condition_dict",
    "_parse_condition_object",
    "_parse_condition_tree",
    "_parse_conditions",
    "_parse_conditions_list",
    "_parse_dict",
    "_parse_dict_condition",
    "_parse_json_string",
    "_parse_object_condition",
    "_parse_single_condition",
    "_post_process_conditions",
    "_process_action",
    "_process_action_async",
    "_process_rule_array",
    "_process_rule_array_async",
    "_process_wrapper_format",
    "_process_wrapper_format_async",
    "_remove_duplicate_issues",
    "_remove_emojis_from_lines",
    "_start_heartbeat",
    "_stop_heartbeat",
    "_translate_to_english",
    "_update_estimated_completion_time",
    "_validate_custom_settings",
    "_validate_custom_template",
    "_validate_field_combinations",
    "_validate_field_types",
    "_validate_field_values",
    "_validate_placeholders",
    "_validate_required_fields",
    "_validate_rule",
    "_validate_rule_async",
    "_validate_rule_object",
    "_validate_template_structure",
    "_value_matches_condition",
    "analyze_rule",
    "analyze_rule_sync",
    "build_completion_chunk",
    "build_error_chunk",
    "build_progress_chunk",
    "build_structured_chunks",
    "build_text_chunks",
    "calculate_structure_metrics",
    "cancel_session",
    "cleanup_old_sessions",
    "clear_custom_templates",
    "create_error_response",
    "create_heartbeat_event",
    "create_retry_event",
    "detect_all_issues",
    "detect_ambiguous_branches",
    "detect_complexity_warnings",
    "detect_duplicate_conditions",
    "detect_invalid_operators",
    "detect_issues_from_rule_direct",
    "detect_language",
    "detect_language_with_confidence",
    "detect_missing_conditions",
    "detect_self_contradiction",
    "detect_type_mismatch",
    "estimate_chunk_count",
    "export_config",
    "format",
    "format_for_streaming",
    "format_number",
    "format_summary",
    "generate_performance_metrics",
    "generate_quality_metrics",
    "generate_stream",
    "get",
    "get_all",
    "get_available_options",
    "get_chunk_count",
    "get_complexity_emoji",
    "get_currency_symbol",
    "get_current_progress",
    "get_custom_template",
    "get_effective_chunk_delay",
    "get_elapsed_time",
    "get_emoji",
    "get_estimated_completion_time",
    "get_estimated_remaining_time",
    "get_field_type",
    "get_language_info",
    "get_language_name",
    "get_language_statistics",
    "get_processed_chunks",
    "get_processing_speed",
    "get_progress_history",
    "get_progress_percentage",
    "get_progress_summary",
    "get_remaining_chunks",
    "get_response_headers",
    "get_rule_statistics",
    "get_section",
    "get_session_count",
    "get_session_status",
    "get_severity_emoji",
    "get_stream",
    "get_supported_languages",
    "get_template",
    "get_template_info",
    "get_template_key",
    "get_text_direction",
    "get_validation_summary",
    "get_warnings",
    "has_key",
    "has_section",
    "has_warnings",
    "infer_field_types",
    "is_active",
    "is_ambiguous",
    "is_complete",
    "is_completed",
    "is_contradictory",
    "is_detailed_level",
    "is_error",
    "is_likely_language",
    "is_progress_update",
    "is_rtl_language",
    "is_simple_level",
    "is_valid_operator",
    "is_valid_type",
    "list_active_sessions",
    "list_completed_sessions",
    "list_custom_templates",
    "load_config",
    "load_custom_template",
    "mark_completed",
    "mark_error",
    "merge_small_chunks",
    "normalize_rule",
    "optimize_chunk_size",
    "parse",
    "parse_multiple",
    "parse_rule_conditions",
    "pause_session",
    "perform_advanced_analysis",
    "process_json_input",
    "process_json_input_async",
    "reload",
    "remove_custom_template",
    "reset",
    "reset_to_default",
    "resume_session",
    "save_config",
    "set",
    "should_include_field",
    "shutdown",
    "start_streaming",
    "start_tracking",
    "stream_events",
    "stream_response",
    "to_dict",
    "to_json",
    "to_summary",
    "update",
    "update_progress",
    "validate",
    "validate_all",
    "validate_config",
    "validate_date_format",
    "validate_dict_keys",
    "validate_email",
    "validate_json_schema",
    "validate_list_length",
    "validate_number_range",
    "validate_phone",
    "validate_regex",
    "validate_required",
    "validate_rule",
    "validate_rule_structure",
    "validate_string_length",
    "validate_url"
  ],
  "function_names": [
    "DFSDetectCycle",
    "_parse_size_string",
    "addMenuItem",
    "addMenuListItem",
    "add_file_handler",
    "analyze_rule",
    "analyze_rule_async",
    "analyze_rule_json",
    "analyze_rule_json_async",
    "analyze_rules",
    "analyze_rules_async",
    "applyTranslations",
    "build_logic_flow_from_condition_tree",
    "checkDuplicateEdges",
    "checkMenu",
    "checkNumberIsInteger",
    "constructAddMenuItemPayload",
    "constructUpdateMenuItemPayload",
    "deleteImage",
    "dfs",
    "dragEnd",
    "fetchAndSaveTranslations",
    "filterLoading",
    "format_analysis_result",
    "getGridCell",
    "getResponse",
    "get_config",
    "get_default_logger",
    "get_formatting_options",
    "get_logger",
    "get_logging_config",
    "get_streaming_options",
    "handleClick",
    "handleDragEnded",
    "handleDragMoving",
    "handleHideSubmenu",
    "handleHover",
    "handleIn",
    "handleLeave",
    "handleRequest",
    "handleSwitchChange",
    "initMenu",
    "installPinia",
    "isActive",
    "loadFonts",
    "moveEvent",
    "openEditDialog",
    "passthrough",
    "removeItem",
    "removeMenuItem",
    "remove_file_handler",
    "resetSelectedMenuItem",
    "resolveMainClient",
    "respondWithMock",
    "sendToClient",
    "serializeRequest",
    "setDialogStatus",
    "setSelectedMenuItem",
    "setUploadedImagesExtend",
    "set_config",
    "set_log_level",
    "setup_logging",
    "stream_analysis_result",
    "syncMousePosition",
    "updateLabelI18n",
    "updateMenuItem",
    "validate_formatting_options",
    "validate_streaming_options"
  ],
  "domain_concepts": [
    "__init__",
    "__init__.py",
    "advanced_analyzer",
    "advanced_analyzer.py",
    "analyzers",
    "arrow_function",
    "async",
    "asyncio",
    "autowired",
    "bean",
    "chunk_builder",
    "chunk_builder.py",
    "class",
    "class_method",
    "concurrency",
    "concurrent",
    "condition_analyzer",
    "condition_analyzer.py",
    "config",
    "config_manager",
    "config_manager.py",
    "constants",
    "constants.py",
    "controller",
    "creation",
    "css",
    "custom_templates",
    "custom_templates.py",
    "data",
    "datetime",
    "debug",
    "deletion",
    "english_templates",
    "english_templates.py",
    "enum",
    "exception",
    "exceptions",
    "exceptions.py",
    "formatters",
    "formatting_options",
    "formatting_options.py",
    "function",
    "generator",
    "getmapping",
    "getter",
    "html",
    "http_streaming",
    "http_streaming.py",
    "import",
    "importlib",
    "interface",
    "issue_detector",
    "issue_detector.py",
    "java",
    "javascript",
    "javascript 파일",
    "json",
    "json_processor",
    "json_processor.py",
    "korean_templates",
    "korean_templates.py",
    "language",
    "language.py",
    "log",
    "logging",
    "logging.py",
    "logic_flow",
    "logic_flow.py",
    "magic_method",
    "manager",
    "metrics_generator",
    "metrics_generator.py",
    "models",
    "models.py",
    "option_validator",
    "option_validator.py",
    "options",
    "package",
    "param",
    "parser",
    "parser.py",
    "pathlib",
    "pattern",
    "postmapping",
    "private_method",
    "processing",
    "progress_tracker",
    "progress_tracker.py",
    "protocols",
    "public_method",
    "putmapping",
    "pydantic",
    "react",
    "regex",
    "repository",
    "requestbody",
    "requestparam",
    "rule_analyzer",
    "rule_analyzer.py",
    "sample_code",
    "serialization",
    "service",
    "setter",
    "shared",
    "spring",
    "spring-boot",
    "sse",
    "sse.py",
    "stream_generator",
    "stream_generator.py",
    "stream_manager",
    "stream_manager.py",
    "stream_models",
    "stream_models.py",
    "streaming",
    "streaming_formatter",
    "streaming_formatter.py",
    "style",
    "sys",
    "system",
    "template",
    "templates",
    "text_formatter",
    "text_formatter.py",
    "time",
    "transactional",
    "typescript",
    "typescript 파일",
    "typing",
    "utils",
    "uuid",
    "validation",
    "validation.py",
    "value",
    "vue",
    "vue.js 컴포넌트"
  ],
  "korean_terms": [
    "검증",
    "검출",
    "로직",
    "변환",
    "복잡성",
    "분석",
    "불일치",
    "생성",
    "스트리밍",
    "오류",
    "이슈",
    "조건",
    "중복",
    "처리",
    "타입",
    "파싱",
    "포맷팅",
    "후처리"
  ],
  "technical_terms": [
    "../../../components/controls/CfButton.vue",
    "../../../components/controls/CfTextarea.vue",
    "../../components/Description/index.vue",
    "../../constants",
    "../../constants.js",
    "../../pages/userinfo/type",
    "../common/CustomTooltip.vue",
    "../constants/index",
    "../dashboard/ItemVolumnChart.vue",
    "../dashboard/MonthlyReportUsersChart.vue",
    "../dashboard/SubscriberTop10.vue",
    "../dashboard/UploadUserImage.vue",
    "../dashboard/UploadUserImageEditMode.vue",
    "../dashboard/UserImage.vue",
    "../dashboard/recently-worked/RecentlyWorkedDetail.vue",
    "../dashboard/recently-worked/RecentlyWorkedItem.vue",
    "../dashboard/subscriber-top-10/SubscriberTop10Item.vue",
    "../extends/extends",
    "../icons/ChevronDown.vue",
    "../icons/DetailIcon.vue",
    "../icons/ItemVolumeIcon.vue",
    "../icons/OpenInNewIcon.vue",
    "../icons/RecentlyWorkedIcon.vue",
    "../icons/ReportAboutUsersIcon.vue",
    "../icons/RequiredIcon.vue",
    "../icons/SubscriberTop10Icon.vue",
    "../icons/UserImageIcon.vue",
    "../layout/DetailPane.vue",
    "../layout/DetailPaneRow.vue",
    "../prod/dashboard/EventType.vue",
    "../prod/icons/CalendarNextIcon.vue",
    "../prod/icons/CalendarPrevIcon.vue",
    "../utilsMock",
    "../utilsMock.js",
    "./AndConditionGroup.vue",
    "./App.vue",
    "./Attributes.vue",
    "./BadgePage.vue",
    "./BaseForm.vue",
    "./CfButton.vue",
    "./CfCard.vue",
    "./ConditionItem.vue",
    "./DetailMenuItem.vue",
    "./ErrorReport.vue",
    "./ExecutionReport.vue",
    "./FieldItem.vue",
    "./GlobalLoading.vue",
    "./History.vue",
    "./InputGridPage.vue",
    "./MessageNode.vue",
    "./OrConditionGroup.vue",
    "./ResizeLayout.vue",
    "./SearchGridPage.vue",
    "./SingleConnectionLine.vue",
    "./StartNode.vue",
    "./WidgetItem.vue",
    "./admin/attributeManagement.store",
    "./admin/customValidation.store",
    "./admin/label.store",
    "./admin/matrixStructure.store",
    "./admin/permissionGroup.store",
    "./admin/ruleEngine.store",
    "./admin/tableStructure.store",
    "./api/prod/bulkUploadApi",
    "./approval.store",
    "./assets/index.postcss",
    "./catalog/data/offer",
    "./catalog/historyTab.store",
    "./cmcd/cmcdHandlers",
    "./componentOb.store",
    "./composables/useApp",
    "./dashboard",
    "./data",
    "./data.js",
    "./data/component",
    "./data/resources",
    "./data/search",
    "./domain/domainHandlers",
    "./extend-utils",
    "./extendCreate.store",
    "./factor-types/FactorGeneralTab.vue",
    "./factor-types/FactorTab.vue",
    "./global.store",
    "./handlers",
    "./http-common",
    "./i18n",
    "./icon/InIcon.vue",
    "./icon/NotInIcon.vue",
    "./impact-analysis/items-offer",
    "./impact-analysis/relation",
    "./impact-analysis/structure",
    "./index",
    "./install-pinia",
    "./loading.store",
    "./matrixSearchPane.store",
    "./offer",
    "./offerCreateProcess.store",
    "./offerDuplicateProcess.store",
    "./org/orgHandlers",
    "./package.json",
    "./path",
    "./prod/prodHandlers",
    "./publishManager.store",
    "./resourceOb.store",
    "./router",
    "./screen/screenHandlers",
    "./smg/sysmsgHandlers",
    "./snackbar.store",
    "./store",
    "./styles/settings.scss",
    "./subs/editDescriptionModal.vue",
    "./tree-view",
    "./types/bulk-upload",
    "./types/common",
    "./user/userHandlers",
    "./utils/date-time-format",
    "./utils/fetch-i18n",
    "./vite.config",
    "./voca/vocaHandlers",
    "@/api/admin/adminApi",
    "@/api/admin/matrix/matrixApi",
    "@/api/admin/path",
    "@/api/admin/path/index.js",
    "@/api/prod/categoryApi",
    "@/api/prod/commonApi",
    "@/api/prod/componentApi",
    "@/api/prod/extendsApi",
    "@/api/prod/impactAnalysisApi",
    "@/api/prod/labelApi",
    "@/api/prod/path",
    "@/api/prod/productApi",
    "@/api/prod/resourceApi",
    "@/components/admin/table-structure/tab/TableGeneralTab.vue",
    "@/components/admin/table-structure/tab/TableTab.vue",
    "@/components/controls/CfAccordion.vue",
    "@/components/controls/CfAvatar.vue",
    "@/components/controls/CfBadge.vue",
    "@/components/controls/CfButton.vue",
    "@/components/controls/CfCard.vue",
    "@/components/controls/CfCarousels.vue",
    "@/components/controls/CfCheckbox.vue",
    "@/components/controls/CfDropdown.vue",
    "@/components/controls/CfFileInput.vue",
    "@/components/controls/CfFooter.vue",
    "@/components/controls/CfInput.vue",
    "@/components/controls/CfListGroup.vue",
    "@/components/controls/CfModal.vue",
    "@/components/controls/CfRadio.vue",
    "@/components/controls/CfSpinner.vue",
    "@/components/controls/CfTabs.vue",
    "@/components/controls/CfTextarea.vue",
    "@/components/controls/CfToast.vue",
    "@/components/controls/CustomDatePicker.vue",
    "@/components/prod/common/BaseButton.vue",
    "@/components/prod/common/BaseInputText.vue",
    "@/components/prod/common/BaseSelectScroll.vue",
    "@/components/prod/common/BaseTextArea.vue",
    "@/components/prod/common/LocomotiveComponent.vue",
    "@/components/prod/extends/relation/manager/relation-viewer/common/ExtendsAccordion.vue",
    "@/components/prod/icons/AdminIcon.vue",
    "@/components/prod/icons/ArrowLeftIcon.vue",
    "@/components/prod/icons/BehavioralIcon.vue",
    "@/components/prod/icons/BizRuleIcon.vue",
    "@/components/prod/icons/BlurBlue.vue",
    "@/components/prod/icons/BlurPurple.vue",
    "@/components/prod/icons/CaretDown.vue",
    "@/components/prod/icons/CategoryIcon.vue",
    "@/components/prod/icons/CheckVerified.vue",
    "@/components/prod/icons/CloseIcon.vue",
    "@/components/prod/icons/CodeIcon.vue",
    "@/components/prod/icons/ContractIcon.vue",
    "@/components/prod/icons/CustomerIcon.vue",
    "@/components/prod/icons/DashboardIcon.vue",
    "@/components/prod/icons/DeleteIcon.vue",
    "@/components/prod/icons/DemographicIcon.vue",
    "@/components/prod/icons/DevicePlanIcon.vue",
    "@/components/prod/icons/DuplicateIcon.vue",
    "@/components/prod/icons/DuplicateRowIcon.vue",
    "@/components/prod/icons/EditIcon.vue",
    "@/components/prod/icons/EnableIcon.vue",
    "@/components/prod/icons/EqualIcon.vue",
    "@/components/prod/icons/ExpireIcon.vue",
    "@/components/prod/icons/ExtendsIcon.vue",
    "@/components/prod/icons/FalseIcon.vue",
    "@/components/prod/icons/FeedbackIcon.vue",
    "@/components/prod/icons/GreaterOrEqualIcon.vue",
    "@/components/prod/icons/GreaterThanIcon.vue",
    "@/components/prod/icons/HelpIcon.vue",
    "@/components/prod/icons/HourglassIcon.vue",
    "@/components/prod/icons/InfoIcon.vue",
    "@/components/prod/icons/LayerIcon.vue",
    "@/components/prod/icons/LessOrEqualIcon.vue",
    "@/components/prod/icons/LessThanIcon.vue",
    "@/components/prod/icons/LocationIcon.vue",
    "@/components/prod/icons/MarketingIcon.vue",
    "@/components/prod/icons/NotEqualIcon.vue",
    "@/components/prod/icons/OpenInNewIcon.vue",
    "@/components/prod/icons/PaymentIcon.vue",
    "@/components/prod/icons/PlusLargeIcon.vue",
    "@/components/prod/icons/ProductServiceIcon.vue",
    "@/components/prod/icons/PublishIcon.vue",
    "@/components/prod/icons/PuzzlesIcon.vue",
    "@/components/prod/icons/RemoveRowIcon.vue",
    "@/components/prod/icons/SaveIcon.vue",
    "@/components/prod/icons/SettingIcon.vue",
    "@/components/prod/icons/SettingsIcon.vue",
    "@/components/prod/icons/ShowDetailIcon.vue",
    "@/components/prod/icons/TrashIcon.vue",
    "@/components/prod/icons/TrueIcon.vue",
    "@/components/prod/icons/UsageIcon.vue",
    "@/components/prod/icons/UserIcon.vue",
    "@/components/prod/icons/WarningIcon.vue",
    "@/components/prod/layout/BaseForm.vue",
    "@/components/prod/layout/BentoGrid.vue",
    "@/components/prod/layout/BentoGridList.vue",
    "@/components/prod/layout/DetailPane.vue",
    "@/components/prod/layout/DetailPaneRow.vue",
    "@/components/prod/layout/UserProfile.vue",
    "@/components/prod/shared/AdditionalTab.vue",
    "@/components/prod/shared/GeneralTab.vue",
    "@/components/prod/shared/GroupSearchPane.vue",
    "@/components/prod/shared/HistoryTab.vue",
    "@/components/prod/shared/OfferSearchPane.vue",
    "@/components/prod/shared/OfferTab.vue",
    "@/components/prod/shared/SearchPane.vue",
    "@/composables/useDownloadFIle",
    "@/composables/useDragUserPocket",
    "@/composables/useGroupCode",
    "@/composables/useInputValidation",
    "@/composables/useRedirect",
    "@/constants",
    "@/constants/",
    "@/constants/admin/label",
    "@/constants/admin/rule-engine",
    "@/constants/admin/rule-field",
    "@/constants/component",
    "@/constants/extendsManager",
    "@/constants/impactAnalysis",
    "@/constants/index",
    "@/constants/multiEntity",
    "@/constants/offer",
    "@/constants/publish",
    "@/constants/resource",
    "@/constants/table",
    "@/constants/userInfor",
    "@/enums",
    "@/enums/columnTypes",
    "@/enums/component",
    "@/enums/component.ts",
    "@/enums/redirect",
    "@/i18n",
    "@/interfaces/admin/admin",
    "@/interfaces/admin/attribute-management",
    "@/interfaces/admin/label-management",
    "@/interfaces/admin/rule-engine",
    "@/interfaces/admin/rule-field",
    "@/interfaces/prod",
    "@/interfaces/prod/CategoryInterface",
    "@/interfaces/prod/HistoryCustomValidation",
    "@/interfaces/prod/HistoryTab",
    "@/interfaces/prod/ImpactAnalysisInterface",
    "@/interfaces/prod/Paginate",
    "@/interfaces/prod/component",
    "@/interfaces/prod/custom-validation",
    "@/interfaces/prod/menu",
    "@/interfaces/prod/offer",
    "@/interfaces/prod/offer.ts",
    "@/interfaces/prod/resource",
    "@/interfaces/prod/structure",
    "@/interfaces/prod/table",
    "@/layouts/DefaultLayout.vue",
    "@/layouts/ProductPlatformLayout.vue",
    "@/mocks/prod/catalog/componentHandlers.ts",
    "@/mocks/prod/catalog/offerHandlers.ts",
    "@/mocks/prod/catalog/resourceHandlers.ts",
    "@/mocks/prod/category/treeViewHandlers.ts",
    "@/mocks/utilsMock",
    "@/pages/admin/subs/custom-validation/ValidationWrapper.vue",
    "@/pages/functions/subs/common/CommonConstants",
    "@/router/index",
    "@/store",
    "@/store/addOn.store",
    "@/store/admin/code.store",
    "@/store/admin/customValidation.store",
    "@/store/admin/domain.store",
    "@/store/admin/domainPopup.store",
    "@/store/admin/factor.store",
    "@/store/admin/matrixStructure.store",
    "@/store/admin/message.store",
    "@/store/admin/permission.store",
    "@/store/admin/ruleEngine.store",
    "@/store/admin/ruleField.store",
    "@/store/admin/screen.store",
    "@/store/admin/tableStructure.store",
    "@/store/admin/terminology.store",
    "@/store/admin/url.store",
    "@/store/admin/user.store",
    "@/store/calendarStore",
    "@/store/category.store",
    "@/store/cmcd.store",
    "@/store/common.store",
    "@/store/component.store",
    "@/store/config.store",
    "@/store/discount.store",
    "@/store/drag.store",
    "@/store/extendSearch.store",
    "@/store/global.store",
    "@/store/impact-analysis.store",
    "@/store/loading.store",
    "@/store/menu.store",
    "@/store/menuInfo.store",
    "@/store/notification.store",
    "@/store/org.store",
    "@/store/orgSearch.store",
    "@/store/pricePlan.store",
    "@/store/resource.store",
    "@/store/snackbar.store",
    "@/store/userImagesStore",
    "@/store/userPocket.store",
    "@/store/users.store",
    "@/types/bulk-upload",
    "@/types/catalog/component/ComponentSearch",
    "@/types/common",
    "@/utils/common-util",
    "@/utils/config-path",
    "@/utils/custom-validation",
    "@/utils/extend-utils",
    "@/utils/file",
    "@/utils/format-data",
    "@/utils/format-data.ts",
    "@/utils/http-common",
    "@/utils/impact-analysis-utils",
    "@/utils/socket",
    "@mdi/font/css/materialdesignicons.min.css",
    "@module-federation/vite",
    "@pinia/testing",
    "@playwright/test",
    "@vitejs/plugin-vue",
    "@vue/cli-service",
    "@vue/test-utils",
    "@vuelidate/core",
    "@vuelidate/validators",
    "@vuepic/vue-datepicker",
    "@vuepic/vue-datepicker/dist/main.css",
    "@vueuse/components",
    "@vueuse/core",
    "@vueuse/head",
    "advanced_analyzer",
    "ai",
    "analysis",
    "analyzers",
    "asyncio",
    "axios",
    "chart.js",
    "chunk_builder",
    "com.fasterxml.jackson.annotation.JsonIgnore",
    "com.fasterxml.jackson.annotation.JsonInclude",
    "com.github.pagehelper.PageHelper",
    "com.github.pagehelper.PageInfo",
    "com.lgcns.svcp.prod.constant.DateConstant",
    "com.lgcns.svcp.prod.constant.SystemConstant.ITEM_CODE",
    "com.lgcns.svcp.prod.constant.SystemConstant.LANG_CODE",
    "com.lgcns.svcp.prod.constant.SystemConstant.OBJ_CODE",
    "com.lgcns.svcp.prod.constant.SystemConstant.OBJ_UUID",
    "com.lgcns.svcp.prod.context.RequestContextHolder",
    "com.lgcns.svcp.prod.dataaccess.CommonDao",
    "com.lgcns.svcp.prod.entity.BaseEntity",
    "com.lgcns.svcp.prod.enums.ExcelType",
    "com.lgcns.svcp.prod.exception.BusinessException",
    "com.lgcns.svcp.prod.filters.CORSFilter",
    "com.lgcns.svcp.prod.i18n.MyLocaleResolver",
    "com.lgcns.svcp.prod.interceptor.ApiLoggingInterceptor",
    "com.lgcns.svcp.prod.interceptor.AuditInterceptor",
    "com.lgcns.svcp.prod.interceptor.UserInterceptor",
    "com.lgcns.svcp.prod.mapper.RelationManagerMapper",
    "com.lgcns.svcp.prod.online.prod.dto.ProdCstcRelDDto",
    "com.lgcns.svcp.prod.online.prod.dto.ProdDpndRelDDto",
    "com.lgcns.svcp.prod.online.prod.service.RelationService",
    "com.lgcns.svcp.prod.ui.prod.dto.BaseDto",
    "com.lgcns.svcp.prod.ui.prod.dto.ItemMappingDto",
    "com.lgcns.svcp.prod.ui.prod.dto.analysis.ImpactAnalysisResponseDto",
    "com.lgcns.svcp.prod.ui.prod.dto.analysis.ItemDto",
    "com.lgcns.svcp.prod.ui.prod.dto.analysis.ProductStructureDto",
    "com.lgcns.svcp.prod.ui.prod.dto.analysis.download.ProductStructureDownloadDto",
    "com.lgcns.svcp.prod.ui.prod.dto.common.AdditionalMultiValueDto",
    "com.lgcns.svcp.prod.ui.prod.dto.common.SelectOptionDto",
    "com.lgcns.svcp.prod.ui.prod.dto.common.metadata.AdditionalDetailDto",
    "com.lgcns.svcp.prod.ui.prod.dto.common.metadata.GeneralDetailDto",
    "com.lgcns.svcp.prod.ui.prod.dto.common.search.SearchAdvancedReq",
    "com.lgcns.svcp.prod.ui.prod.dto.export.MultiEntityExportDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.CountTargetResDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.ItemOffrResDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.OfferDpdcRelDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.OffrDpdcReqDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.OffrGrpResDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.RelationGridViewDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.RelationGridViewEntity",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.RelationGridViewExportDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.RelationGridViewSearchDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.RelationViewReqDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.RelationViewResDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.SaveTargetReqDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.TargetReqDto",
    "com.lgcns.svcp.prod.ui.prod.dto.extend.TargetResDto",
    "com.lgcns.svcp.prod.ui.prod.dto.group.InsertGroupOfferDto",
    "com.lgcns.svcp.prod.ui.prod.dto.history.save.OfferStrcHistDto",
    "com.lgcns.svcp.prod.ui.prod.dto.item.detail.ItemMappingDetailDto",
    "com.lgcns.svcp.prod.ui.prod.dto.multiEntity.MultiEntityAdditionalDto",
    "com.lgcns.svcp.prod.ui.prod.dto.multiEntity.MultiEntityDto",
    "com.lgcns.svcp.prod.ui.prod.dto.multiEntity.create.CreateEntityReqDto",
    "com.lgcns.svcp.prod.ui.prod.dto.multiEntity.rel.EntityItemRelResDto",
    "com.lgcns.svcp.prod.ui.prod.dto.multiEntity.rel.EntityScopeDto",
    "com.lgcns.svcp.prod.ui.prod.dto.multiEntity.rel.SaveEntityObjRelReqDto",
    "com.lgcns.svcp.prod.ui.prod.dto.multiEntity.search.SearchItemRelationReq",
    "com.lgcns.svcp.prod.ui.prod.dto.multiEntity.search.SearchMultiEntityReqDto",
    "com.lgcns.svcp.prod.ui.prod.enums.entity.EntityScope",
    "com.lgcns.svcp.prod.ui.prod.enums.entity.EntityTypeCode",
    "com.lgcns.svcp.prod.ui.prod.service.UIExtendsService",
    "com.lgcns.svcp.prod.ui.prod.service.UIMultiEntityService",
    "com.lgcns.svcp.prod.ui.prod.service.UIRelationService",
    "com.lgcns.svcp.prod.ui.prod.service.UiImpactAnalysisService",
    "com.lgcns.svcp.prod.ui.prod.service.admin.UiTableService",
    "com.lgcns.svcp.prod.ui.prod.service.customexcel.RelationManagerExcelHelper",
    "com.lgcns.svcp.prod.util.DateUtil",
    "com.lgcns.svcp.prod.util.FileUtil",
    "com.lgcns.svcp.prod.util.StringUtilCustom",
    "com.lgcns.svcp.prod.util.UuidUtil",
    "com.lgcns.svcp.prod.util.excel.ExcelHelper",
    "com.lgcns.svcp.prod.util.excel.ExcelInput",
    "com.lgcns.svcp.prod.util.excel.annotation.CustomTitleHeader",
    "com.lgcns.svcp.prod.util.excel.annotation.Value",
    "com.lgcns.svcp.prod.util.paging.BasePaginationDto",
    "com.lgcns.svcp.prod.util.paging.PageResult",
    "complexity",
    "concurrent",
    "condition",
    "condition_analyzer",
    "config",
    "config_manager",
    "constants",
    "custom_templates",
    "datetime",
    "detection",
    "duplicate",
    "english_templates",
    "enum",
    "error",
    "exceptions",
    "formatters",
    "formatting",
    "formatting_options",
    "grid-layout-plus",
    "http_streaming",
    "importlib",
    "io.awspring.cloud.s3.S3Resource",
    "io.awspring.cloud.s3.S3Template",
    "io.swagger.v3.oas.annotations.Hidden",
    "io.swagger.v3.oas.annotations.Operation",
    "io.swagger.v3.oas.annotations.Parameter",
    "io.swagger.v3.oas.annotations.tags.Tag",
    "io.swagger.v3.oas.models.OpenAPI",
    "io.swagger.v3.oas.models.info.Info",
    "issue",
    "issue_detector",
    "jakarta.servlet.ServletOutputStream",
    "jakarta.servlet.http.Cookie",
    "jakarta.servlet.http.HttpServletRequest",
    "jakarta.servlet.http.HttpServletResponse",
    "jakarta.servlet.http.Part",
    "java.awt.Color",
    "java.io.ByteArrayInputStream",
    "java.io.IOException",
    "java.io.InputStream",
    "java.io.UnsupportedEncodingException",
    "java.lang.annotation.ElementType",
    "java.lang.annotation.Retention",
    "java.lang.annotation.RetentionPolicy",
    "java.lang.annotation.Target",
    "java.lang.reflect.Field",
    "java.lang.reflect.InvocationTargetException",
    "java.math.BigDecimal",
    "java.sql.Timestamp",
    "java.text.DateFormat",
    "java.text.NumberFormat",
    "java.text.ParseException",
    "java.text.SimpleDateFormat",
    "java.time.Duration",
    "java.time.LocalDate",
    "java.time.LocalDateTime",
    "java.time.format.DateTimeFormatter",
    "java.util.ArrayList",
    "java.util.Arrays",
    "java.util.Calendar",
    "java.util.Collections",
    "java.util.Currency",
    "java.util.Date",
    "java.util.GregorianCalendar",
    "java.util.HashMap",
    "java.util.LinkedHashMap",
    "java.util.List",
    "java.util.Locale",
    "java.util.Map",
    "java.util.Objects",
    "java.util.Optional",
    "java.util.UUID",
    "java.util.concurrent.TimeUnit",
    "java.util.function.BiConsumer",
    "java.util.regex.Pattern",
    "java.util.stream.Collectors",
    "java.util.stream.IntStream",
    "json",
    "json_processor",
    "keen-slider",
    "keen-slider/keen-slider.min.css",
    "korean_templates",
    "language",
    "lodash-es",
    "lodash-es/capitalize",
    "lodash-es/clone",
    "lodash-es/cloneDeep",
    "lodash-es/debounce",
    "lodash-es/every",
    "lodash-es/first",
    "lodash-es/includes",
    "lodash-es/isEmpty",
    "lodash-es/isEqual",
    "lodash-es/set",
    "lodash-es/throttle",
    "lodash-es/union",
    "lodash-es/uniqBy",
    "logging",
    "logic",
    "lombok.AllArgsConstructor",
    "lombok.Builder",
    "lombok.Data",
    "lombok.Getter",
    "lombok.NoArgsConstructor",
    "lombok.RequiredArgsConstructor",
    "lombok.Setter",
    "lombok.extern.slf4j.Slf4j",
    "metrics_generator",
    "mismatch",
    "models",
    "moment-timezone",
    "msw",
    "msw/browser",
    "node:url",
    "option_validator",
    "options",
    "org.apache.commons.codec.binary.Base64",
    "org.apache.commons.lang3.StringUtils",
    "org.apache.ibatis.executor.BatchResult",
    "org.apache.ibatis.plugin.Interceptor",
    "org.apache.ibatis.session.ExecutorType",
    "org.apache.ibatis.session.SqlSession",
    "org.apache.ibatis.session.SqlSessionFactory",
    "org.apache.poi.hssf.usermodel.HSSFWorkbook",
    "org.apache.poi.ss.usermodel.BorderStyle",
    "org.apache.poi.ss.usermodel.Cell",
    "org.apache.poi.ss.usermodel.CellStyle",
    "org.apache.poi.ss.usermodel.CellType",
    "org.apache.poi.ss.usermodel.DataFormat",
    "org.apache.poi.ss.usermodel.DataFormatter",
    "org.apache.poi.ss.usermodel.DateUtil",
    "org.apache.poi.ss.usermodel.FillPatternType",
    "org.apache.poi.ss.usermodel.Font",
    "org.apache.poi.ss.usermodel.HorizontalAlignment",
    "org.apache.poi.ss.usermodel.RichTextString",
    "org.apache.poi.ss.usermodel.Row",
    "org.apache.poi.ss.usermodel.Sheet",
    "org.apache.poi.ss.usermodel.VerticalAlignment",
    "org.apache.poi.ss.usermodel.Workbook",
    "org.apache.poi.xssf.usermodel.XSSFColor",
    "org.apache.poi.xssf.usermodel.XSSFWorkbook",
    "org.apache.tika.Tika",
    "org.mybatis.spring.SqlSessionTemplate",
    "org.mybatis.spring.boot.autoconfigure.ConfigurationCustomizer",
    "org.mybatis.spring.support.SqlSessionDaoSupport",
    "org.springframework.beans.factory.annotation.Autowired",
    "org.springframework.beans.factory.annotation.Value",
    "org.springframework.boot.SpringApplication",
    "org.springframework.boot.autoconfigure.SpringBootApplication",
    "org.springframework.boot.web.client.RestTemplateBuilder",
    "org.springframework.boot.web.embedded.tomcat.TomcatServletWebServerFactory",
    "org.springframework.boot.web.server.WebServerFactoryCustomizer",
    "org.springframework.boot.web.servlet.FilterRegistrationBean",
    "org.springframework.context.MessageSource",
    "org.springframework.context.annotation.Bean",
    "org.springframework.context.annotation.Configuration",
    "org.springframework.context.annotation.Primary",
    "org.springframework.context.i18n.LocaleContextHolder",
    "org.springframework.context.support.ResourceBundleMessageSource",
    "org.springframework.http.ResponseEntity",
    "org.springframework.messaging.simp.config.MessageBrokerRegistry",
    "org.springframework.stereotype.Component",
    "org.springframework.stereotype.Repository",
    "org.springframework.stereotype.Service",
    "org.springframework.transaction.annotation.Transactional",
    "org.springframework.util.CollectionUtils",
    "org.springframework.util.MethodInvoker",
    "org.springframework.web.bind.annotation.GetMapping",
    "org.springframework.web.bind.annotation.ModelAttribute",
    "org.springframework.web.bind.annotation.PathVariable",
    "org.springframework.web.bind.annotation.PostMapping",
    "org.springframework.web.bind.annotation.PutMapping",
    "org.springframework.web.bind.annotation.RequestBody",
    "org.springframework.web.bind.annotation.RequestMapping",
    "org.springframework.web.bind.annotation.RequestParam",
    "org.springframework.web.bind.annotation.RestController",
    "org.springframework.web.client.RestTemplate",
    "org.springframework.web.filter.CommonsRequestLoggingFilter",
    "org.springframework.web.servlet.LocaleResolver",
    "org.springframework.web.servlet.config.annotation.InterceptorRegistry",
    "org.springframework.web.servlet.config.annotation.WebMvcConfigurer",
    "org.springframework.web.socket.config.annotation.EnableWebSocketMessageBroker",
    "org.springframework.web.socket.config.annotation.StompEndpointRegistry",
    "org.springframework.web.socket.config.annotation.WebSocketMessageBrokerConfigurer",
    "parser",
    "parsing",
    "pathlib",
    "pinia",
    "pinia-plugin-persistedstate",
    "prismjs",
    "prismjs/themes/prism.css",
    "progress_tracker",
    "pydantic",
    "qs",
    "re",
    "rule",
    "rule_analyzer",
    "search",
    "sockjs-client",
    "sse",
    "stompjs",
    "stream_generator",
    "stream_manager",
    "stream_models",
    "streaming",
    "streaming_formatter",
    "sys",
    "templates",
    "text_formatter",
    "time",
    "type",
    "typing",
    "unplugin-auto-import/vite",
    "unplugin-vue-components/vite",
    "utils",
    "uuid",
    "v-calendar",
    "v-calendar/style.css",
    "validation",
    "vite",
    "vite-svg-loader",
    "vitest",
    "vitest/config",
    "vue",
    "vue-chartjs",
    "vue-draggable-plus",
    "vue-i18n",
    "vue-router",
    "vue3-cookies",
    "vuetify",
    "vuetify/components",
    "vuetify/directives",
    "vuetify/labs/VTreeview",
    "vuetify/lib/components/index.mjs",
    "vuetify/styles"
  ]
}