{
  "class_names": [
    "AddOnAndComponentDto",
    "AddOnDto",
    "AdditionalAndResourceDto",
    "AdditionalBlngResMDto",
    "AdditionalColumnsDto",
    "AdditionalCreateDto",
    "AdditionalDetailDto",
    "AdditionalDto",
    "AdditionalMultiValueDto",
    "AdditionalPricePlanAndAddOnCreateDto",
    "AdditionalPricePlanAndAddOnDto",
    "AdditionalPricePlanAndAddOnUpdateDto",
    "AdditionalServiceResMDto",
    "AdditionalUpdateDto",
    "AdditonalAttributeHistDto",
    "AddonGeneralDto",
    "AdvancedAnalysisError",
    "AdvancedAnalyzer",
    "AllowanceAndResourceDto",
    "AllowanceDto",
    "AlowMDto",
    "AnalysisOptions",
    "ApiLog",
    "ApiLoggingInterceptor",
    "AppConfig",
    "AprvFlowTmptMDto",
    "AprvFlowTmptMSearchReqDto",
    "AprvFlowTmptStepLDto",
    "AprvFlowTmptSubStepLDto",
    "Attribute",
    "AttributeAdditionalDto",
    "AttributeChangeDto",
    "AttributeChangedResDto",
    "AttributeDetailDto",
    "AttributeDto",
    "AttributeGeneralDto",
    "AttributeItemDto",
    "AttributeItemStrcDto",
    "AttributeMiddleItemDto",
    "AttributeMultipleDto",
    "AttributeNewDto",
    "AttributeRequirePartOne",
    "AttributeUpperLowerItemsDto",
    "AttributeUtil",
    "AttributeViewDto",
    "AuditInterceptor",
    "AuthProperties",
    "AuthService",
    "BaseDto",
    "BaseEntity",
    "BaseFeeAndResourceDto",
    "BaseFeeDto",
    "BaseItemSearchPaneDto",
    "BasePaginationDto",
    "BaseSearchPaneParamClass",
    "BatchAnalysisResult",
    "BillingDto",
    "BillingElementDto",
    "BlngInfoMDto",
    "BoxAndAttrRequest",
    "BoxAndAttrRespone",
    "BsfDto",
    "BsnLineDto",
    "BuilderFactorDto",
    "BuilderFactorValueDto",
    "BuilderReqDto",
    "BusinessException",
    "CORSFilter",
    "CalendarViewDto",
    "CalendarViewRequest",
    "CalendarViewRespone",
    "CategoryController",
    "CategoryDescriptionDto",
    "CategoryOfferRelDto",
    "CategoryPathDto",
    "CategoryPathExportDto",
    "CategorySaveDto",
    "CategoryService",
    "CategoryTabDto",
    "CategoryTreeDto",
    "CategoryTreeUpdateRequestDto",
    "CatgMDto",
    "CellBoxDto",
    "ChangedDto",
    "ChangedResDto",
    "CharacteristicService",
    "ChngDataListL",
    "ChngDataListLDto",
    "ChngDataListLSearchReqDto",
    "ChunkBuilder",
    "ChunkType",
    "CmcdGrpDTO",
    "ColumnMetaDataDto",
    "CommonCodeService",
    "CommonController",
    "CommonOrdrUtil",
    "CommonService",
    "CommonUtil",
    "ComponentAddResourceDto",
    "ComponentAddResourceReq",
    "ComponentAddResourceRes",
    "ComponentController",
    "ComponentCreateInfoRes",
    "ComponentExcelHelperImpl",
    "ComponentExportDto",
    "ComponentGeneralDto",
    "ComponentPagingDto",
    "ComponentResourceReq",
    "ComponentSearch",
    "ComponentSearchAdvancedReq",
    "ComponentSearchPagingDto",
    "ComponentSearchReq",
    "ComponentSearchRes",
    "ComponentService",
    "ComponentStructureExportDto",
    "ComponentUpdateReq",
    "ComponentUpdateResourceReq",
    "ConditionAnalysisError",
    "ConditionAnalyzer",
    "ConditionContoller",
    "ConditionDto",
    "ConditionGroupDto",
    "ConditionIssue",
    "ConditionService",
    "ConditionTree",
    "ConfigManager",
    "ConfigurationError",
    "ConstraintViolationAdvice",
    "ControllerSupport",
    "CookieUtil",
    "CountTargetResDto",
    "CreateComponentReq",
    "CreateEntityReqDto",
    "CtgrLevelDto",
    "CtgrNodeEntity",
    "CtgrNodeMDto",
    "CtgrTabEntity",
    "CustValidAttrHistoryDto",
    "CustValidValHistoryDto",
    "CustomHistoryDto",
    "CustomTemplateManager",
    "CustomValidationComponentItem",
    "CustomValidationExcelDto",
    "CustomValidationExcelEntity",
    "CustomValidationExcelHelperImpl",
    "CustomValidationExportDto",
    "CustomValidationItem",
    "CustomValidationItemResponse",
    "CustomValidationMainRespone",
    "CustomValidationPagingResponse",
    "CustomValidationRestDto",
    "DashboardConstant",
    "DataTypeError",
    "DateConstant",
    "DateFormatUtil",
    "DateUtil",
    "DcCfgrtDto",
    "DcRateDto",
    "DcTrgtDto",
    "DcntCstcMDto",
    "DcntMDto",
    "DcntMUpdateDto",
    "DcntRatMDto",
    "DcntTrgtInfoDDto",
    "DcntTrgtInfoMDto",
    "DetailLevel",
    "DeviceWithCatgUuid",
    "DiscountAndComponentDto",
    "DiscountConfigurationDto",
    "DiscountDto",
    "DiscountGeneralDto",
    "DiscountRateDto",
    "DsbdItemStatEntity",
    "DsbdListViewDto",
    "DsbdListViewEntity",
    "DsbdMonthlyOfferEntity",
    "DsbdMonthlyOfferResponse",
    "DsbdMonthlyUserGroupOfferEntity",
    "DsbdMonthlyUserGroupOfferResponse",
    "DsbdOfferSubCntDto",
    "DsbdOfferSubCntEntity",
    "DsbdOfferSubCntExportDto",
    "DsbdRecentlyWorkEntity",
    "DsbdRecentlyWorkExportDto",
    "DsbdUserSetEntity",
    "DsbdViewDto",
    "DsbdViewEntity",
    "DsbdViewPstEntity",
    "DsbdViewPstRequest",
    "DtexPlcyMDto",
    "DynamicFieldReq",
    "EndpointTestController",
    "EnglishTemplates",
    "EntityItemRelResDto",
    "EntityObjRelResDto",
    "EntityScopeDto",
    "EqipTrmMDto",
    "ErrorResponseBody",
    "EvaluationResult",
    "EventDateDto",
    "ExcelCellStyleSupport",
    "ExcelCellStyleSupportCustom",
    "ExcelHelperImpl",
    "ExcelInput",
    "ExcelReader",
    "ExcelWriter",
    "FactorDto",
    "FactorTypeDto",
    "FactorValueDto",
    "FieldAnalysis",
    "FieldController",
    "FieldDto",
    "FieldEntity",
    "FieldSearchPagingDto",
    "FieldService",
    "FileUploadController",
    "FileUtil",
    "FirstAddAttrReqDto",
    "FormattingOptionValidator",
    "FormattingOptions",
    "GeneralAttribute",
    "GeneralAttributeHistDto",
    "GeneralBlngResMDto",
    "GeneralDetailDto",
    "GeneralPricePlanAndAddOnCreateDto",
    "GeneralPricePlanAndAddOnDto",
    "GeneralPricePlanAndAddOnUpdateDto",
    "GeneralServiceResMDto",
    "GroupController",
    "GroupDetailResDto",
    "GroupExcelHelperImpl",
    "GroupExportDto",
    "GroupSearchRes",
    "GroupService",
    "GroupStructureExportDto",
    "GroupedAlowMDto",
    "GroupedBlngInfoMDto",
    "GroupedBlngResMDto",
    "GroupedDcntCstcMDto",
    "GroupedDcntMDto",
    "GroupedDcntRatMDto",
    "GroupedDcntTrgtInfoMDto",
    "GroupedLobInfoDto",
    "GroupedMfMDto",
    "GroupedPdspTossLkgeDDto",
    "GroupedPricePlanAndAddOnCreateDto",
    "GroupedPricePlanAndAddOnUpdateDto",
    "GroupedProdMDto",
    "GroupedQosInfoDto",
    "GroupedRtngDcntMDto",
    "GroupedServiceResMDto",
    "GroupedSlinInfoMDto",
    "GroupedSpamInfoDto",
    "GroupedUsfeMDto",
    "HTTPStreamingProtocol",
    "HistoryChangeDto",
    "HistoryChangeResDto",
    "HistoryDetailResDto",
    "HistoryResponse",
    "ImpactAnalysisResponseDto",
    "InsertGroupOfferDto",
    "IssueDetectionError",
    "IssueDetector",
    "Item",
    "ItemCodeInfo",
    "ItemCodeRequestDto",
    "ItemDto",
    "ItemMappingDetailDto",
    "ItemMappingDto",
    "ItemOffrResDto",
    "ItemReportData",
    "ItemReq",
    "ItemStructureDto",
    "ItemVolumeDto",
    "ItemVolumeGroupDto",
    "ItemVolumeRespone",
    "ItemsDetailTypeCodeNameDto",
    "ItemsMDto",
    "JSONProcessingError",
    "KoreanTemplates",
    "LabelExportDto",
    "LabelItemDto",
    "LabelItemUpdateDto",
    "LabelSearchPagingDto",
    "Language",
    "LanguageDetector",
    "LanguageItemDto",
    "LanguageSupport",
    "LargeItemDto",
    "LimMDto",
    "ListChanged",
    "LobInfoDto",
    "LobMDto",
    "LobMrktRelDDto",
    "LogicError",
    "LogicFlow",
    "MapUtil",
    "MatrixDDto",
    "MatrixExcelHelperImpl",
    "MatrixExportReqDto",
    "MatrixMDto",
    "MatrixMeasureDDto",
    "MatrixMeasureMDto",
    "Menu",
    "MessageAndResourceDto",
    "MessageDto",
    "MetadataServiceImpl",
    "MetricsGenerator",
    "MfMDto",
    "MiddleItemDto",
    "MiddleItemEntity",
    "MultiEntityAdditionalDto",
    "MultiEntityDto",
    "MultiEntityExportDto",
    "MultiLangLabelDto",
    "MultiLangLabelEntity",
    "MultipleAttrDto",
    "MyBatisCommonDao",
    "MyBatisConfig",
    "MyLocaleResolver",
    "NotificationDto",
    "OfferBySaleChannelDto",
    "OfferComponentStructureReq",
    "OfferComponentStructureRes",
    "OfferController",
    "OfferCreateInfo",
    "OfferDpdcRelDto",
    "OfferExportDto",
    "OfferGeneralDto",
    "OfferGroupAndOfferDto",
    "OfferGroupDto",
    "OfferGroupMDto",
    "OfferGroupRelHistDto",
    "OfferGroupWithOfferDto",
    "OfferInfoDto",
    "OfferListExcelHelperImpl",
    "OfferOfLeafNodeDto",
    "OfferSearchDto",
    "OfferSearchReq",
    "OfferSearchRes",
    "OfferService",
    "OfferStrcHistDto",
    "OfferStructureComponent",
    "OfferStructureDetailReq",
    "OfferStructureDetailRes",
    "OfferStructureExportDto",
    "OfferStructureUpdateReq",
    "OffersOfCatgegoryReqDto",
    "OffrDpdcReqDto",
    "OffrGrpMDto",
    "OffrGrpProdItemDDto",
    "OffrGrpResDto",
    "PatternUtil",
    "PdspTossLkgeDDto",
    "PerformanceMetrics",
    "PricePlanAndAddOnCreateRequestDto",
    "PricePlanAndAddOnDto",
    "PricePlanAndComponentDto",
    "PricePlanDto",
    "PricePlanGeneralDto",
    "ProdApplication",
    "ProdCmmGrpDto",
    "ProdCstcRelD",
    "ProdCstcRelDDto",
    "ProdDpndRelDDto",
    "ProdItemMapgMDto",
    "ProdMDto",
    "ProdMUpdateDto",
    "ProdMWithCatgUuid",
    "ProdStruDDto",
    "ProdStruDWithItemsMDto",
    "ProductStructureDownloadDto",
    "ProductStructureDto",
    "ProgressTracker",
    "PubAprvMDto",
    "PubAprvStepLDto",
    "PubAprvSubStepLDto",
    "PubPackageDto",
    "PubPrcsTaskMDto",
    "PubRqstTaskLDto",
    "PubRqstTaskMDto",
    "PubRqstTaskMSearchReqDto",
    "QosInfoDto",
    "QosMDto",
    "QosPlcyRelDDto",
    "QualityMetrics",
    "QualityThresholds",
    "QueryInfoDto",
    "RatingDiscountAndResourceDto",
    "RatingDiscountDto",
    "RatingElementDto",
    "RawBlngResMDto",
    "RawServiceResMDto",
    "RecentWorkDetailViewDto",
    "RecentWorkExcelHelperImpl",
    "RecentWorkSimpleViewDto",
    "RecentlyWorkSearchPagingDto",
    "RegisteredRuleInfo",
    "RelationController",
    "RelationGridViewDto",
    "RelationGridViewEntity",
    "RelationGridViewExportDto",
    "RelationGridViewSearchDto",
    "RelationManagerExcelHelperImpl",
    "RelationSearchRes",
    "RelationService",
    "RelationViewReqDto",
    "RelationViewResDto",
    "ReportDesignResponse",
    "ReportMetadata",
    "RequestCommonCodeDto",
    "RequestCommonCodeNameDto",
    "RequestContextHolder",
    "RequestGuardFilter",
    "RequestOfferWithCatgUuidDto",
    "RequestSelectOptionsDto",
    "ResourceController",
    "ResourceCreateInfoRes",
    "ResourceCreateReq",
    "ResourceExcelHelperImpl",
    "ResourceExportDto",
    "ResourceGeneralRes",
    "ResourceSearchDto",
    "ResourceSearchReq",
    "ResourceService",
    "ResourceUpdateReq",
    "ResoureSearchRes",
    "RestTemplateConfig",
    "RtngDcntMDto",
    "Rule",
    "RuleAnalyzer",
    "RuleAnalyzerError",
    "RuleCategoryController",
    "RuleCategoryService",
    "RuleCategoryTreeDto",
    "RuleCondition",
    "RuleController",
    "RuleDto",
    "RuleFireResult",
    "RuleInfoDto",
    "RuleInput",
    "RuleInsertRequest",
    "RuleJsonInput",
    "RuleJsonOutput",
    "RuleJsonProcessor",
    "RuleParser",
    "RuleParsingError",
    "RuleService",
    "RuleTestInput",
    "RuleWrapper",
    "S3TemplateUtil",
    "SSEProtocol",
    "SaleCnbyProdDDto",
    "SaleCpnyDto",
    "SalesDto",
    "SaveCategoryReqDtq",
    "SaveCusSearchDto",
    "SaveEntityObjRelReqDto",
    "SaveGroupReqDto",
    "SaveTableDataDto",
    "SaveTableDataReqDto",
    "SaveTargetReqDto",
    "SearcTableStrcReqDto",
    "SearchAdvancedReq",
    "SearchFactorReqDto",
    "SearchFactorTypeReqDto",
    "SearchGroupReqDto",
    "SearchGroupWithDetailReqDto",
    "SearchGroupWithDetailResDto",
    "SearchItemRelationReq",
    "SearchMatrixReqDto",
    "SearchMatrixResDto",
    "SearchMultiEntityReqDto",
    "SearchRelationReqDto",
    "SearchTableDataDto",
    "SearchTableDataReqDto",
    "SearchTableTypeReqDto",
    "SearchValidation",
    "SecurityHeaderFilter",
    "SelectOptionDto",
    "ServiceElementDto",
    "SlinInfoMDto",
    "Sorting",
    "SpamDto",
    "SpamInfoDto",
    "SpamLvwuPlcyDDto",
    "SpamLvwuPlcyRelDDto",
    "SpamMDto",
    "StreamGenerator",
    "StreamManager",
    "StreamingChunk",
    "StreamingFormatter",
    "StreamingOptions",
    "StreamingSession",
    "StreamingStatus",
    "StringUtilCustom",
    "StructureChangeDto",
    "StructureChangeResDto",
    "StructureInfo",
    "SubscribeTop10SearchPagingDto",
    "SubscribeTopSimpleViewResponse",
    "SubscriberTop10ExcelHelperImpl",
    "SwaggerConfig",
    "SystemConstant",
    "TableColumnDto",
    "TableColumnKeyValue",
    "TableExcelHelperImpl",
    "TableStrcDto",
    "TableStrcTypeDto",
    "TargetReqDto",
    "TargetResDto",
    "TextFormatter",
    "TokenAuthFilter",
    "TomcatErrorController",
    "TomcatRelaxedCharsCustomizer",
    "TreeViewDto",
    "UIController",
    "UIExtendsController",
    "UIExtendsService",
    "UIGroupController",
    "UIGroupService",
    "UIHistoryController",
    "UIHistoryService",
    "UIImpactAnalysisController",
    "UIMultiEntityController",
    "UIMultiEntityService",
    "UINotificationController",
    "UINotificationService",
    "UIOfferController",
    "UIPublishController",
    "UIPublishService",
    "UIRelationController",
    "UIRelationService",
    "UiAttributeManagementController",
    "UiAttributeManagementServiceImpl",
    "UiCalendarServiceImpl",
    "UiCategoryController",
    "UiCategoryServiceImpl",
    "UiCommonService",
    "UiComponentController",
    "UiComponentService",
    "UiCustomValidationController",
    "UiCustomValidationServiceImpl",
    "UiDashboardController",
    "UiDashboardServiceImpl",
    "UiFactorController",
    "UiFactorService",
    "UiImpactAnalysisService",
    "UiLabelManagementController",
    "UiLabelServiceImpl",
    "UiMatrixController",
    "UiMatrixService",
    "UiMetadataController",
    "UiOfferService",
    "UiRecentlyWorkServiceImpl",
    "UiResourceController",
    "UiResourceService",
    "UiSubscriberTop10ServiceImpl",
    "UiTableController",
    "UiTableService",
    "UiUserImageServiceImpl",
    "UiUserPocketController",
    "UiUserPocketServiceImpl",
    "UsageFeeAndResourceDto",
    "UsageFeeDto",
    "UserContext",
    "UserImageDeleteRequest",
    "UserImageDto",
    "UserImageMapper",
    "UserImageRequest",
    "UserImageSaveRequest",
    "UserImageValidator",
    "UserInterceptor",
    "UserPocketCustomEntity",
    "UserPocketDto",
    "UserPocketEntity",
    "UserPocketRequest",
    "UserPocketRespone",
    "UsfeMDto",
    "UuidUtil",
    "ValidationError",
    "ValidationHelper",
    "ValidationResult",
    "ValueChangeDto",
    "VoiceAndResourceDto",
    "VoiceDto",
    "WebConfig",
    "WebSocketConfig"
  ],
  "method_names": [
    "__init__",
    "_add_detailed_fields",
    "_add_emojis_to_lines",
    "_analyze_batch_rules",
    "_analyze_batch_rules_async",
    "_analyze_conditions",
    "_analyze_fields",
    "_analyze_logic_flow",
    "_analyze_original_structure",
    "_analyze_performance",
    "_analyze_single_rule",
    "_analyze_single_rule_async",
    "_analyze_structure",
    "_apply_template",
    "_apply_template_variations",
    "_calculate_branch_coverage",
    "_calculate_completeness_score",
    "_calculate_complexity",
    "_calculate_complexity_score",
    "_calculate_consistency_score",
    "_calculate_depth",
    "_calculate_field_complexity",
    "_calculate_final_statistics",
    "_calculate_maintainability_score",
    "_calculate_performance_metrics",
    "_calculate_readability_score",
    "_calculate_values_range",
    "_check_contradiction",
    "_check_number_field_ambiguity",
    "_check_number_field_missing_ranges",
    "_check_redundant_pattern",
    "_check_string_field_ambiguity",
    "_compare_non_numeric",
    "_complete_session",
    "_convert_value_by_type",
    "_count_all_conditions",
    "_count_field_conditions",
    "_count_issues_by_type",
    "_count_logical_operators",
    "_count_total_conditions",
    "_create_basic_info_chunk",
    "_create_completion_chunk",
    "_create_condition_signature",
    "_create_error_chunk",
    "_create_error_response",
    "_create_header_chunk",
    "_create_issue_chunk",
    "_create_issues_chunks",
    "_create_performance_chunk",
    "_create_quality_chunk",
    "_create_report_metadata",
    "_create_structure_chunk",
    "_detect_field_missing_edge_cases",
    "_detect_field_redundant_conditions",
    "_detect_issues",
    "_detect_issues_async",
    "_detect_potential_dead_code",
    "_determine_field_type",
    "_dict_to_text",
    "_evaluate_quality_metrics",
    "_extract_condition_details",
    "_extract_conditions_from_tree",
    "_extract_field_conditions_recursive",
    "_extract_unique_fields",
    "_filter_simple_fields",
    "_format_chunk",
    "_format_error",
    "_format_error_event",
    "_format_progress",
    "_format_progress_event",
    "_format_sse_event",
    "_generate_optimization_suggestions",
    "_generate_summary",
    "_get_average_processing_time",
    "_get_condition_field",
    "_get_condition_uuid",
    "_get_current_timestamp",
    "_get_detailed_template",
    "_get_disp_name",
    "_get_normal_template",
    "_get_simple_template",
    "_get_timestamp",
    "_get_total_items",
    "_get_validation_result_for_session",
    "_heartbeat_loop",
    "_identify_bottleneck_conditions",
    "_infer_type_from_value",
    "_is_date_string",
    "_is_numeric_value",
    "_merge_config",
    "_parse_condition_dict",
    "_parse_condition_object",
    "_parse_condition_tree",
    "_parse_conditions",
    "_parse_conditions_list",
    "_parse_dict",
    "_parse_dict_condition",
    "_parse_json_string",
    "_parse_object_condition",
    "_parse_single_condition",
    "_post_process_conditions",
    "_process_action",
    "_process_action_async",
    "_process_rule_array",
    "_process_rule_array_async",
    "_process_wrapper_format",
    "_process_wrapper_format_async",
    "_remove_duplicate_issues",
    "_remove_emojis_from_lines",
    "_start_heartbeat",
    "_stop_heartbeat",
    "_translate_to_english",
    "_update_estimated_completion_time",
    "_validate_custom_settings",
    "_validate_custom_template",
    "_validate_field_combinations",
    "_validate_field_types",
    "_validate_field_values",
    "_validate_placeholders",
    "_validate_required_fields",
    "_validate_rule",
    "_validate_rule_async",
    "_validate_rule_object",
    "_validate_template_structure",
    "_value_matches_condition",
    "analyze_rule",
    "analyze_rule_sync",
    "build_completion_chunk",
    "build_error_chunk",
    "build_progress_chunk",
    "build_structured_chunks",
    "build_text_chunks",
    "calculate_structure_metrics",
    "cancel_session",
    "cleanup_old_sessions",
    "clear_custom_templates",
    "create_error_response",
    "create_heartbeat_event",
    "create_retry_event",
    "detect_all_issues",
    "detect_ambiguous_branches",
    "detect_complexity_warnings",
    "detect_duplicate_conditions",
    "detect_invalid_operators",
    "detect_issues_from_rule_direct",
    "detect_language",
    "detect_language_with_confidence",
    "detect_missing_conditions",
    "detect_self_contradiction",
    "detect_type_mismatch",
    "estimate_chunk_count",
    "export_config",
    "format",
    "format_for_streaming",
    "format_number",
    "format_summary",
    "generate_performance_metrics",
    "generate_quality_metrics",
    "generate_stream",
    "get",
    "get_all",
    "get_available_options",
    "get_chunk_count",
    "get_complexity_emoji",
    "get_currency_symbol",
    "get_current_progress",
    "get_custom_template",
    "get_effective_chunk_delay",
    "get_elapsed_time",
    "get_emoji",
    "get_estimated_completion_time",
    "get_estimated_remaining_time",
    "get_field_type",
    "get_language_info",
    "get_language_name",
    "get_language_statistics",
    "get_processed_chunks",
    "get_processing_speed",
    "get_progress_history",
    "get_progress_percentage",
    "get_progress_summary",
    "get_remaining_chunks",
    "get_response_headers",
    "get_rule_statistics",
    "get_section",
    "get_session_count",
    "get_session_status",
    "get_severity_emoji",
    "get_stream",
    "get_supported_languages",
    "get_template",
    "get_template_info",
    "get_template_key",
    "get_text_direction",
    "get_validation_summary",
    "get_warnings",
    "has_key",
    "has_section",
    "has_warnings",
    "infer_field_types",
    "is_active",
    "is_ambiguous",
    "is_complete",
    "is_completed",
    "is_contradictory",
    "is_detailed_level",
    "is_error",
    "is_likely_language",
    "is_progress_update",
    "is_rtl_language",
    "is_simple_level",
    "is_valid_operator",
    "is_valid_type",
    "list_active_sessions",
    "list_completed_sessions",
    "list_custom_templates",
    "load_config",
    "load_custom_template",
    "mark_completed",
    "mark_error",
    "merge_small_chunks",
    "normalize_rule",
    "optimize_chunk_size",
    "parse",
    "parse_multiple",
    "parse_rule_conditions",
    "pause_session",
    "perform_advanced_analysis",
    "process_json_input",
    "process_json_input_async",
    "reload",
    "remove_custom_template",
    "reset",
    "reset_to_default",
    "resume_session",
    "save_config",
    "set",
    "should_include_field",
    "shutdown",
    "start_streaming",
    "start_tracking",
    "stream_events",
    "stream_response",
    "to_dict",
    "to_json",
    "to_summary",
    "update",
    "update_progress",
    "validate",
    "validate_all",
    "validate_config",
    "validate_date_format",
    "validate_dict_keys",
    "validate_email",
    "validate_json_schema",
    "validate_list_length",
    "validate_number_range",
    "validate_phone",
    "validate_regex",
    "validate_required",
    "validate_rule",
    "validate_rule_structure",
    "validate_string_length",
    "validate_url"
  ],
  "function_names": [
    "DFSDetectCycle",
    "_parse_size_string",
    "addMenuItem",
    "addMenuListItem",
    "add_file_handler",
    "analyze_rule",
    "analyze_rule_async",
    "analyze_rule_json",
    "analyze_rule_json_async",
    "analyze_rules",
    "analyze_rules_async",
    "applyTranslations",
    "build_logic_flow_from_condition_tree",
    "cancelEditDialog",
    "checkDuplicateEdges",
    "checkMenu",
    "checkNumberIsInteger",
    "closeDialog",
    "closeEditDialog",
    "constructAddMenuItemPayload",
    "constructUpdateMenuItemPayload",
    "deleteImage",
    "dfs",
    "dragEnd",
    "editImage",
    "fetchAndSaveTranslations",
    "fetchHistory",
    "filterLoading",
    "formatDateToYYYYMMDD",
    "format_analysis_result",
    "getGridCell",
    "getResponse",
    "get_config",
    "get_default_logger",
    "get_formatting_options",
    "get_logger",
    "get_logging_config",
    "get_streaming_options",
    "goToNextSlide",
    "goToPrevSlide",
    "handleCheckboxChange",
    "handleClick",
    "handleDeleteImage",
    "handleDragEnded",
    "handleDragMoving",
    "handleHideSubmenu",
    "handleHover",
    "handleImageUpload",
    "handleIn",
    "handleLeave",
    "handleRequest",
    "handleSwitchChange",
    "initMenu",
    "installPinia",
    "isActive",
    "loadFonts",
    "moveEvent",
    "openEditDialog",
    "passthrough",
    "removeItem",
    "removeMenuItem",
    "remove_file_handler",
    "resetSelectedMenuItem",
    "resolveMainClient",
    "respondWithMock",
    "sendToClient",
    "serializeRequest",
    "setDialogStatus",
    "setSelectedMenuItem",
    "setUploadedImagesExtend",
    "set_config",
    "set_log_level",
    "setup_logging",
    "startProgressLoop",
    "stream_analysis_result",
    "syncMousePosition",
    "updateLabelI18n",
    "updateMenuItem",
    "validate_formatting_options",
    "validate_streaming_options"
  ],
  "domain_concepts": [
    "Users",
    "__init__",
    "__init__.py",
    "abstract",
    "advanced_analyzer",
    "advanced_analyzer.py",
    "analyzers",
    "arrow_function",
    "async",
    "asyncio",
    "autowired",
    "bean",
    "chunk_builder",
    "chunk_builder.py",
    "class",
    "class_method",
    "codemuse-backend",
    "concurrency",
    "concurrent",
    "condition_analyzer",
    "condition_analyzer.py",
    "config",
    "config_manager",
    "config_manager.py",
    "constants",
    "constants.py",
    "controller",
    "creation",
    "css",
    "custom_templates",
    "custom_templates.py",
    "data",
    "datetime",
    "debug",
    "deletemapping",
    "deletion",
    "english_templates",
    "english_templates.py",
    "enum",
    "exception",
    "exceptions",
    "exceptions.py",
    "formatters",
    "formatting_options",
    "formatting_options.py",
    "function",
    "generator",
    "getmapping",
    "getter",
    "html",
    "http_streaming",
    "http_streaming.py",
    "import",
    "importlib",
    "interface",
    "issue_detector",
    "issue_detector.py",
    "java",
    "javascript",
    "javascript 파일",
    "json",
    "json_processor",
    "json_processor.py",
    "korean_templates",
    "korean_templates.py",
    "language",
    "language.py",
    "log",
    "logging",
    "logging.py",
    "logic_flow",
    "logic_flow.py",
    "magic_method",
    "manager",
    "metrics_generator",
    "metrics_generator.py",
    "models",
    "models.py",
    "option_validator",
    "option_validator.py",
    "options",
    "package",
    "param",
    "parser",
    "parser.py",
    "pathlib",
    "pathvariable",
    "pattern",
    "postmapping",
    "private_method",
    "processing",
    "progress_tracker",
    "progress_tracker.py",
    "projects",
    "protocols",
    "public_method",
    "putmapping",
    "pydantic",
    "react",
    "regex",
    "repository",
    "requestbody",
    "requestparam",
    "roseline",
    "rule_analyzer",
    "rule_analyzer.py",
    "sample_code",
    "serialization",
    "service",
    "setter",
    "shared",
    "spring",
    "spring-boot",
    "sse",
    "sse.py",
    "stream_generator",
    "stream_generator.py",
    "stream_manager",
    "stream_manager.py",
    "stream_models",
    "stream_models.py",
    "streaming",
    "streaming_formatter",
    "streaming_formatter.py",
    "style",
    "sys",
    "system",
    "template",
    "templates",
    "text_formatter",
    "text_formatter.py",
    "time",
    "transactional",
    "typescript",
    "typescript 파일",
    "typing",
    "utils",
    "uuid",
    "valid",
    "validation",
    "validation.py",
    "value",
    "vue",
    "vue.js 컴포넌트"
  ],
  "korean_terms": [
    "검색",
    "검증",
    "검출",
    "로직",
    "변환",
    "복잡성",
    "분석",
    "불일치",
    "생성",
    "스트리밍",
    "오류",
    "이슈",
    "조건",
    "중복",
    "처리",
    "타입",
    "파싱",
    "포맷팅",
    "후처리"
  ],
  "technical_terms": [
    "../../../components/controls/CfButton.vue",
    "../../../components/controls/CfTextarea.vue",
    "../../components/Description/index.vue",
    "../../components/controls/CfButton.vue",
    "../../components/controls/examples/CfButtonExample.ts",
    "../../constants",
    "../../constants.js",
    "../../icons/DashboardCloseIcon.vue",
    "../../icons/DetailIcon.vue",
    "../../icons/DownloadIcon.vue",
    "../../icons/RecentlyWorkedIcon.vue",
    "../../layout/DetailPane.vue",
    "../../layout/DetailPaneRow.vue",
    "../../pages/userinfo/type",
    "../../shared/MultiEntityTab.vue",
    "../../shared/ResourceTab.vue",
    "../../shared/SearchPane.vue",
    "../../types/domain",
    "../ExpansionPanel.vue",
    "../OrgUtils",
    "../cmcd.store",
    "../common/BasePopover.vue",
    "../common/BaseSelectScroll.vue",
    "../common/CustomTooltip.vue",
    "../constants/index",
    "../dashboard/ItemVolumnChart.vue",
    "../dashboard/MonthlyReportUsersChart.vue",
    "../dashboard/SubscriberTop10.vue",
    "../dashboard/UploadUserImage.vue",
    "../dashboard/UploadUserImageEditMode.vue",
    "../dashboard/UserImage.vue",
    "../dashboard/recently-worked/RecentlyWorkedDetail.vue",
    "../dashboard/recently-worked/RecentlyWorkedItem.vue",
    "../dashboard/subscriber-top-10/SubscriberTop10Item.vue",
    "../extends/extends",
    "../icons/ChevronDown.vue",
    "../icons/DashboardCloseIcon.vue",
    "../icons/DeleteIcon.vue",
    "../icons/DetailIcon.vue",
    "../icons/DownloadIcon.vue",
    "../icons/FolderIcon.vue",
    "../icons/ItemVolumeIcon.vue",
    "../icons/OpenInNewIcon.vue",
    "../icons/RecentlyWorkedIcon.vue",
    "../icons/ReportAboutUsersIcon.vue",
    "../icons/RequiredIcon.vue",
    "../icons/SubscriberTop10Icon.vue",
    "../icons/UpdateIcon.vue",
    "../icons/UserImageIcon.vue",
    "../icons/UserImageIconDetail.vue",
    "../layout/DetailPane.vue",
    "../layout/DetailPaneRow.vue",
    "../prod/dashboard/EventType.vue",
    "../prod/icons/CalendarNextIcon.vue",
    "../prod/icons/CalendarPrevIcon.vue",
    "../snackbar.store",
    "../type",
    "../utilsMock",
    "../utilsMock.js",
    "./ActionButtons.vue",
    "./AddButtons.vue",
    "./AndConditionGroup.vue",
    "./App.vue",
    "./AttributeCodeSearchItem.vue",
    "./AttributeItem.vue",
    "./AttributeType.vue",
    "./AttributeTypeViewOnly.vue",
    "./Attributes.vue",
    "./BadgePage.vue",
    "./BaseForm.vue",
    "./CfButton.vue",
    "./CfCard.vue",
    "./ChatBotFrame.vue",
    "./ConditionItem.vue",
    "./ConfirmErrorPopup.vue",
    "./ConnectLineCanvas.vue",
    "./CustomDataList.vue",
    "./CustomSelectList.vue",
    "./CustomValidationTableData.vue",
    "./DetailMenuItem.vue",
    "./ErrorReport.vue",
    "./ExecutionReport.vue",
    "./FieldItem.vue",
    "./FieldItemEdit.vue",
    "./GlobalLoading.vue",
    "./GridExtendedDisplayMode.vue",
    "./GridFocusedDisplayMode.vue",
    "./GroupDetailDuplicate.vue",
    "./GroupList.vue",
    "./History.vue",
    "./InputGridPage.vue",
    "./LabelAccordion.vue",
    "./LabelAction.vue",
    "./LabelItem.vue",
    "./LabelSearchFilter.vue",
    "./LabelSearchItem.vue",
    "./MemoItem.vue",
    "./MessageNode.vue",
    "./OfferTabDuplicate.vue",
    "./OrConditionGroup.vue",
    "./OrgInfoPopup.vue",
    "./OrgUtils",
    "./OrgUtils.ts",
    "./RecentlyWorkedGrid.vue",
    "./ResizeLayout.vue",
    "./SearchGridPage.vue",
    "./SearchOrderPage.vue",
    "./SingleConnectionLine.vue",
    "./StartNode.vue",
    "./TreeView/TreeListLevelDescriptionSection.vue",
    "./TreeView/TreeViewActionSection.vue",
    "./TreeView/TreeViewChart.vue",
    "./UpdateTodoModal.vue",
    "./UserPocket.vue",
    "./ValidationDialog.vue",
    "./ValidationItem.vue",
    "./ValidationView.vue",
    "./ValidationViewItem.vue",
    "./WidgetItem.vue",
    "./admin/attributeManagement.store",
    "./admin/customValidation.store",
    "./admin/label.store",
    "./admin/matrixStructure.store",
    "./admin/permissionGroup.store",
    "./admin/ruleEngine.store",
    "./admin/tableStructure.store",
    "./api/prod/bulkUploadApi",
    "./approval.store",
    "./assets/index.postcss",
    "./catalog/data/offer",
    "./catalog/historyTab.store",
    "./cmcd/cmcdHandlers",
    "./common/CommonConstants",
    "./componentOb.store",
    "./composables/useApp",
    "./dashboard",
    "./data",
    "./data.js",
    "./data/component",
    "./data/resources",
    "./data/search",
    "./domain/domainHandlers",
    "./extend-utils",
    "./extendCreate.store",
    "./factor-types/FactorGeneralTab.vue",
    "./factor-types/FactorTab.vue",
    "./global.store",
    "./handlers",
    "./http-common",
    "./i18n",
    "./icon/InIcon.vue",
    "./icon/NotInIcon.vue",
    "./impact-analysis/items-offer",
    "./impact-analysis/relation",
    "./impact-analysis/structure",
    "./index",
    "./install-pinia",
    "./item-edit/AdditionalDetail.vue",
    "./item-edit/AdditionalEdit.vue",
    "./item-edit/GeneralDetail.vue",
    "./item-edit/GeneralEdit.vue",
    "./item-edit/TreeViewDetail.vue",
    "./item-edit/TreeViewEdit.vue",
    "./items-view/ItemMenu.vue",
    "./label",
    "./label-management",
    "./loading.store",
    "./matrixSearchPane.store",
    "./mock",
    "./offer",
    "./offerCreateProcess.store",
    "./offerDuplicateProcess.store",
    "./org/orgHandlers",
    "./package.json",
    "./path",
    "./popup/CreateFuncModal.vue",
    "./popup/CreateFuncPrmtModal.vue",
    "./prod/prodHandlers",
    "./publishManager.store",
    "./resourceOb.store",
    "./router",
    "./ruleEnginePath",
    "./screen/screenHandlers",
    "./smg/sysmsgHandlers",
    "./snackbar.store",
    "./store",
    "./styles/settings.scss",
    "./subs/CreateEmployeeModal.vue",
    "./subs/attribute/ItemEdit.vue",
    "./subs/attribute/ItemsView.vue",
    "./subs/attribute/item-edit/AttributeCodeSearch.vue",
    "./subs/attribute/item-edit/LabelSearch.vue",
    "./subs/custom-validation/ActionSearch.vue",
    "./subs/custom-validation/ConditionSearch.vue",
    "./subs/custom-validation/CustomValidationGrid.vue",
    "./subs/custom-validation/CustomValidationTable.vue",
    "./subs/custom-validation/History.vue",
    "./subs/editDescriptionModal.vue",
    "./subs/editNoticeModal.vue",
    "./subs/label/LabelDetail.vue",
    "./subs/label/LabelSearch.vue",
    "./subscriber-top-10/SubscriberTop10Chart.vue",
    "./subscriber-top-10/SubscriberTop10Grid.vue",
    "./tree-view",
    "./type",
    "./types/bulk-upload",
    "./types/common",
    "./types/domain",
    "./user/userHandlers",
    "./utils/date-time-format",
    "./utils/fetch-i18n",
    "./vite.config",
    "./voca/vocaHandlers",
    "@//components/Description/index.vue",
    "@/api/admin/adminApi",
    "@/api/admin/matrix/matrixApi",
    "@/api/admin/path",
    "@/api/admin/path/index.js",
    "@/api/prod/approvalApi",
    "@/api/prod/categoryApi",
    "@/api/prod/commonApi",
    "@/api/prod/componentApi",
    "@/api/prod/componentApi.ts",
    "@/api/prod/customValidationApi",
    "@/api/prod/extendsApi",
    "@/api/prod/impactAnalysisApi",
    "@/api/prod/labelApi",
    "@/api/prod/offerApi",
    "@/api/prod/path",
    "@/api/prod/productApi",
    "@/api/prod/resourceApi",
    "@/assets/arrow.png",
    "@/assets/icons/plus.svg",
    "@/assets/search.png",
    "@/components/Description/index",
    "@/components/Description/index.vue",
    "@/components/admin/rule-engine/FieldList.vue",
    "@/components/admin/rule-engine/RuleDetail.vue",
    "@/components/admin/rule-engine/RuleReport.vue",
    "@/components/admin/rule-engine/RuleSearch.vue",
    "@/components/admin/rule-engine/TestInput.vue",
    "@/components/admin/rule-engine/rule-structure/RuleStructure.vue",
    "@/components/admin/table-structure/tab/TableGeneralTab.vue",
    "@/components/admin/table-structure/tab/TableTab.vue",
    "@/components/bulk-upload/DataTable.vue",
    "@/components/controls/CfAccordion.vue",
    "@/components/controls/CfAvatar.vue",
    "@/components/controls/CfBadge.vue",
    "@/components/controls/CfButton.vue",
    "@/components/controls/CfButtonIcon.vue",
    "@/components/controls/CfCard.vue",
    "@/components/controls/CfCarousels.vue",
    "@/components/controls/CfCheckbox.vue",
    "@/components/controls/CfDateRangePicker.vue",
    "@/components/controls/CfDatetimePicker.vue",
    "@/components/controls/CfDropdown.vue",
    "@/components/controls/CfFileInput.vue",
    "@/components/controls/CfFooter.vue",
    "@/components/controls/CfInput.vue",
    "@/components/controls/CfListGroup.vue",
    "@/components/controls/CfModal.vue",
    "@/components/controls/CfRadio.vue",
    "@/components/controls/CfSpinner.vue",
    "@/components/controls/CfTabs.vue",
    "@/components/controls/CfTextarea.vue",
    "@/components/controls/CfToast.vue",
    "@/components/controls/CustomDatePicker.vue",
    "@/components/controls/examples/CfAccordionExample",
    "@/components/controls/examples/CfAlertExample",
    "@/components/controls/examples/CfAvatarExample",
    "@/components/controls/examples/CfBadgeExample",
    "@/components/controls/examples/CfCardDropdownExample",
    "@/components/controls/examples/CfCardExample",
    "@/components/controls/examples/CfCarouselExample",
    "@/components/controls/examples/CfCheckboxExample",
    "@/components/controls/examples/CfDropdownExample",
    "@/components/controls/examples/CfFileInputExample",
    "@/components/controls/examples/CfFooterExample",
    "@/components/controls/examples/CfInputExample",
    "@/components/controls/examples/CfListGroupExample",
    "@/components/controls/examples/CfModalExample",
    "@/components/controls/examples/CfRadioExample",
    "@/components/controls/examples/CfSpinnerExample",
    "@/components/controls/examples/CfTabsExample",
    "@/components/controls/examples/CfTextareaExample",
    "@/components/controls/examples/CfToastExample",
    "@/components/prod/catalog/component/ComponentAndOfferPane.vue",
    "@/components/prod/catalog/impact-analysis/OneView.vue",
    "@/components/prod/catalog/impact-analysis/TargetSearch.vue",
    "@/components/prod/catalog/offer/TypeOfProd.vue",
    "@/components/prod/category/tree-view/tabs/CategoryGeneralTab.vue",
    "@/components/prod/category/tree-view/tabs/CategoryOfferTab.vue",
    "@/components/prod/common/BaseButton.vue",
    "@/components/prod/common/BaseCanvas.vue",
    "@/components/prod/common/BaseDateTimePicker.vue",
    "@/components/prod/common/BaseInputText.vue",
    "@/components/prod/common/BaseMultiSelect.vue",
    "@/components/prod/common/BasePopover.vue",
    "@/components/prod/common/BasePopup.vue",
    "@/components/prod/common/BaseSelectScroll.vue",
    "@/components/prod/common/BaseTabs.vue",
    "@/components/prod/common/BaseTextArea.vue",
    "@/components/prod/common/BaseTotalSearchResult.vue",
    "@/components/prod/common/DateTimePopup.vue",
    "@/components/prod/common/LocomotiveComponent.vue",
    "@/components/prod/common/NoData.vue",
    "@/components/prod/common/SearchAndRefreshButton.vue",
    "@/components/prod/common/SwitchViewTable.vue",
    "@/components/prod/dashboard/ItemVolume.vue",
    "@/components/prod/dashboard/MonthlyReportItems.vue",
    "@/components/prod/dashboard/MonthlyReportUsers.vue",
    "@/components/prod/dashboard/ProfileComponent.vue",
    "@/components/prod/dashboard/RecentlyWorked.vue",
    "@/components/prod/dashboard/SubscriberTop10.vue",
    "@/components/prod/dashboard/UserImage.vue",
    "@/components/prod/extends/mutil-entity/search/tabs/MultiEntityAdditionalTab.vue",
    "@/components/prod/extends/mutil-entity/search/tabs/MultiEntityGeneralTab.vue",
    "@/components/prod/extends/relation/manager/relation-viewer/common/ExtendsAccordion.vue",
    "@/components/prod/extends/search/GroupAndOfferPane.vue",
    "@/components/prod/icons/AIcon.vue",
    "@/components/prod/icons/AdminIcon.vue",
    "@/components/prod/icons/ArrowDownIcon.vue",
    "@/components/prod/icons/ArrowLeftIcon.vue",
    "@/components/prod/icons/ArrowUpIcon.vue",
    "@/components/prod/icons/BLinearIcon.vue",
    "@/components/prod/icons/BehavioralIcon.vue",
    "@/components/prod/icons/BizRuleIcon.vue",
    "@/components/prod/icons/BlurBlue.vue",
    "@/components/prod/icons/BlurPurple.vue",
    "@/components/prod/icons/CaretDown.vue",
    "@/components/prod/icons/CategoryIcon.vue",
    "@/components/prod/icons/CheckVerified.vue",
    "@/components/prod/icons/ChevronDown.vue",
    "@/components/prod/icons/CloseIcon.vue",
    "@/components/prod/icons/CloseSmallIcon.vue",
    "@/components/prod/icons/CodeIcon.vue",
    "@/components/prod/icons/CollapseIcon.vue",
    "@/components/prod/icons/ComponentIcon.vue",
    "@/components/prod/icons/ContractIcon.vue",
    "@/components/prod/icons/CustomValidationNextIcon.vue",
    "@/components/prod/icons/CustomValidationPrevIcon.vue",
    "@/components/prod/icons/CustomerIcon.vue",
    "@/components/prod/icons/DIcon.vue",
    "@/components/prod/icons/DashboardIcon.vue",
    "@/components/prod/icons/DecoIcon.vue",
    "@/components/prod/icons/DeleteIcon.vue",
    "@/components/prod/icons/DemographicIcon.vue",
    "@/components/prod/icons/DeviceIcon.vue",
    "@/components/prod/icons/DevicePlanIcon.vue",
    "@/components/prod/icons/DotGridIcon.vue",
    "@/components/prod/icons/DotsVerticalIcon.vue",
    "@/components/prod/icons/DownloadIcon.vue",
    "@/components/prod/icons/DuplicateIcon.vue",
    "@/components/prod/icons/DuplicateRowIcon.vue",
    "@/components/prod/icons/EditIcon.vue",
    "@/components/prod/icons/EnableIcon.vue",
    "@/components/prod/icons/EqualIcon.vue",
    "@/components/prod/icons/ExpandIcon.vue",
    "@/components/prod/icons/ExpireIcon.vue",
    "@/components/prod/icons/ExtendsIcon.vue",
    "@/components/prod/icons/FalseIcon.vue",
    "@/components/prod/icons/FeedbackIcon.vue",
    "@/components/prod/icons/FolderIcon.vue",
    "@/components/prod/icons/GreaterOrEqualIcon.vue",
    "@/components/prod/icons/GreaterThanIcon.vue",
    "@/components/prod/icons/HelpIcon.vue",
    "@/components/prod/icons/HistoryIcon.vue",
    "@/components/prod/icons/HourglassIcon.vue",
    "@/components/prod/icons/InfoIcon.vue",
    "@/components/prod/icons/LayerIcon.vue",
    "@/components/prod/icons/LessOrEqualIcon.vue",
    "@/components/prod/icons/LessThanIcon.vue",
    "@/components/prod/icons/LocationIcon.vue",
    "@/components/prod/icons/MarketingIcon.vue",
    "@/components/prod/icons/MatrixIcon.vue",
    "@/components/prod/icons/MultiEntityIcon.vue",
    "@/components/prod/icons/NotEqualIcon.vue",
    "@/components/prod/icons/OpenInNewIcon.vue",
    "@/components/prod/icons/PIcon.vue",
    "@/components/prod/icons/PaymentIcon.vue",
    "@/components/prod/icons/PlusLargeIcon.vue",
    "@/components/prod/icons/PlusSmallIcon.vue",
    "@/components/prod/icons/ProductServiceIcon.vue",
    "@/components/prod/icons/PublishIcon.vue",
    "@/components/prod/icons/PuzzlesIcon.vue",
    "@/components/prod/icons/RLinearIcon.vue",
    "@/components/prod/icons/RelationIcon.vue",
    "@/components/prod/icons/RemoveRowIcon.vue",
    "@/components/prod/icons/SLinearIcon.vue",
    "@/components/prod/icons/SaveIcon.vue",
    "@/components/prod/icons/SettingIcon.vue",
    "@/components/prod/icons/SettingsIcon.vue",
    "@/components/prod/icons/ShowDetailIcon.vue",
    "@/components/prod/icons/SimplePlusIcon.vue",
    "@/components/prod/icons/StructureIcon.vue",
    "@/components/prod/icons/TableIcon.vue",
    "@/components/prod/icons/TrashIcon.vue",
    "@/components/prod/icons/TrueIcon.vue",
    "@/components/prod/icons/UsageIcon.vue",
    "@/components/prod/icons/UserIcon.vue",
    "@/components/prod/icons/WarningIcon.vue",
    "@/components/prod/layout/BaseForm.vue",
    "@/components/prod/layout/BentoGrid.vue",
    "@/components/prod/layout/BentoGridList.vue",
    "@/components/prod/layout/DetailPane.vue",
    "@/components/prod/layout/DetailPaneRow.vue",
    "@/components/prod/layout/FourColumns.vue",
    "@/components/prod/layout/UserProfile.vue",
    "@/components/prod/publish/PublishPackageSearch.vue",
    "@/components/prod/publish/step/ApprovalFlow.vue",
    "@/components/prod/publish/step/ComposePackage.vue",
    "@/components/prod/publish/step/GeneralAttibutes.vue",
    "@/components/prod/publish/step/PublishStep.vue",
    "@/components/prod/shared/AdditionalTab.vue",
    "@/components/prod/shared/DetailSearchPane.vue",
    "@/components/prod/shared/GeneralTab.vue",
    "@/components/prod/shared/GroupSearchPane.vue",
    "@/components/prod/shared/HistoryTab.vue",
    "@/components/prod/shared/MultiEntityTab.vue",
    "@/components/prod/shared/OfferSearchPane.vue",
    "@/components/prod/shared/OfferTab.vue",
    "@/components/prod/shared/ResourceTab.vue",
    "@/components/prod/shared/SearchPane.vue",
    "@/composables/useDownloadFIle",
    "@/composables/useDragUserPocket",
    "@/composables/useFormValidation",
    "@/composables/useGroupCode",
    "@/composables/useInputValidation",
    "@/composables/useRedirect",
    "@/constants",
    "@/constants/",
    "@/constants/admin/admin",
    "@/constants/admin/attribute",
    "@/constants/admin/code",
    "@/constants/admin/domain",
    "@/constants/admin/label",
    "@/constants/admin/rule-engine",
    "@/constants/admin/rule-field",
    "@/constants/admin/sysMessage",
    "@/constants/admin/terminology",
    "@/constants/category",
    "@/constants/chatbot",
    "@/constants/component",
    "@/constants/dashboard",
    "@/constants/extendsManager",
    "@/constants/generalField",
    "@/constants/impactAnalysis",
    "@/constants/index",
    "@/constants/multiEntity",
    "@/constants/offer",
    "@/constants/publish",
    "@/constants/resource",
    "@/constants/table",
    "@/constants/userInfor",
    "@/enums",
    "@/enums/columnTypes",
    "@/enums/component",
    "@/enums/component.ts",
    "@/enums/customValidation",
    "@/enums/labelManagement",
    "@/enums/offer",
    "@/enums/redirect",
    "@/i18n",
    "@/interfaces/admin/admin",
    "@/interfaces/admin/attribute-management",
    "@/interfaces/admin/label-management",
    "@/interfaces/admin/rule-engine",
    "@/interfaces/admin/rule-field",
    "@/interfaces/prod",
    "@/interfaces/prod/CategoryInterface",
    "@/interfaces/prod/HistoryCustomValidation",
    "@/interfaces/prod/HistoryTab",
    "@/interfaces/prod/ImpactAnalysisInterface",
    "@/interfaces/prod/Paginate",
    "@/interfaces/prod/component",
    "@/interfaces/prod/custom-validation",
    "@/interfaces/prod/menu",
    "@/interfaces/prod/offer",
    "@/interfaces/prod/offer.ts",
    "@/interfaces/prod/publishInterface",
    "@/interfaces/prod/resource",
    "@/interfaces/prod/structure",
    "@/interfaces/prod/table",
    "@/layouts/DefaultLayout.vue",
    "@/layouts/ProductPlatformLayout.vue",
    "@/mocks/prod/catalog/componentHandlers.ts",
    "@/mocks/prod/catalog/offerHandlers.ts",
    "@/mocks/prod/catalog/resourceHandlers.ts",
    "@/mocks/prod/category/treeViewHandlers.ts",
    "@/mocks/utilsMock",
    "@/pages/admin/subs/DataTableCustom.vue",
    "@/pages/admin/subs/TableAnalysis.vue",
    "@/pages/admin/subs/custom-validation/ValidationWrapper.vue",
    "@/pages/admin/subs/domain/DomainContent.vue",
    "@/pages/admin/subs/domain/DomainLookup.vue",
    "@/pages/admin/subs/domain/DomainLookupTable.vue",
    "@/pages/admin/subs/menu/DetailMenuContent.vue",
    "@/pages/admin/subs/menu/DetailMenuContentSearch.vue",
    "@/pages/admin/subs/menu/DetailMenuHeadForm.vue",
    "@/pages/admin/subs/menu/MenuSearch.vue",
    "@/pages/admin/subs/menu/MenuUpdatePopup.vue",
    "@/pages/admin/subs/menu/TreeMenu.vue",
    "@/pages/admin/subs/menu/TreeMenuSearch.vue",
    "@/pages/admin/subs/org/OrgSearch.vue",
    "@/pages/admin/subs/org/TreeOganizition.vue",
    "@/pages/admin/subs/permission/PermissionListPopup.vue",
    "@/pages/admin/subs/permission/group/PermissionCreatePopup.vue",
    "@/pages/admin/subs/permission/group/PermissionGroupForm.vue",
    "@/pages/admin/subs/screen/ScreenListPopup.vue",
    "@/pages/admin/subs/screen/ScreenPopup.vue",
    "@/pages/admin/subs/screen/ScreenTable.vue",
    "@/pages/admin/subs/screen/UrlTable.vue",
    "@/pages/admin/subs/term/TermAnalysisPopup.vue",
    "@/pages/admin/subs/user/UserPopup.vue",
    "@/pages/admin/types/message",
    "@/pages/code/subs/COMMC001P.vue",
    "@/pages/code/subs/COMMC002P.vue",
    "@/pages/code/subs/CmcdTable.vue",
    "@/pages/code/subs/CodeSearch.vue",
    "@/pages/code/type",
    "@/pages/domain/subs/COMMD001P.vue",
    "@/pages/domain/subs/DomainSearch.vue",
    "@/pages/domain/subs/DomainTable.vue",
    "@/pages/domain/type",
    "@/pages/functions/subs/CreateCustomerAttributeModal.vue",
    "@/pages/functions/subs/CreateOrderEventModal.vue",
    "@/pages/functions/subs/CreateOrderModal.vue",
    "@/pages/functions/subs/CreateSeachOrderModal.vue",
    "@/pages/functions/subs/CreateSystemModal.vue",
    "@/pages/functions/subs/DetailOrderModal.vue",
    "@/pages/functions/subs/UpdateCustomerAttributeModal.vue",
    "@/pages/functions/subs/UpdateOrderEventModal.vue",
    "@/pages/functions/subs/UpdateOrderModal.vue",
    "@/pages/functions/subs/UpdateSearchOrderModal.vue",
    "@/pages/functions/subs/UpdateSystemModal.vue",
    "@/pages/functions/subs/common/CommonConstants",
    "@/pages/orgInfo/subs/COMM0001P.vue",
    "@/pages/orgInfo/subs/COMM0003P.vue",
    "@/pages/orgInfo/subs/OrgInfoSearch.vue",
    "@/pages/orgInfo/subs/OrgInfoTable.vue",
    "@/pages/orgInfo/type",
    "@/pages/solution/OrderEventPage.vue",
    "@/pages/solution/SearchOrderPage.vue",
    "@/pages/solution/SystemPage.vue",
    "@/pages/solution/popup/DetailLogManagementModal.vue",
    "@/pages/syssms/subs/COMMS001P.vue",
    "@/pages/syssms/subs/SysSmsSearch.vue",
    "@/pages/syssms/subs/SysSmsTable.vue",
    "@/pages/userinfo/subs/COMMU001P.vue",
    "@/pages/userinfo/subs/COMMU003P.vue",
    "@/pages/userinfo/subs/UserInfoSearch.vue",
    "@/pages/userinfo/subs/UserInfoTable.vue",
    "@/pages/userinfo/type",
    "@/pages/vocap/subs/COMMD002P.vue",
    "@/pages/vocap/subs/COMMV001P.vue",
    "@/pages/vocap/subs/COMMV002P.vue",
    "@/pages/vocap/subs/COMMW001P.vue",
    "@/pages/vocap/subs/CustomCellRenderer.vue",
    "@/pages/vocap/subs/SearchPanel.vue",
    "@/pages/vocap/subs/VocapTable.vue",
    "@/pages/vocap/type",
    "@/router",
    "@/router/index",
    "@/store",
    "@/store/addOn.store",
    "@/store/admin/attributeManagement.store",
    "@/store/admin/code.store",
    "@/store/admin/customValidation.store",
    "@/store/admin/domain.store",
    "@/store/admin/domainPopup.store",
    "@/store/admin/factor.store",
    "@/store/admin/historyCustomValidation.store",
    "@/store/admin/label.store",
    "@/store/admin/matrixStructure.store",
    "@/store/admin/message.store",
    "@/store/admin/permission.store",
    "@/store/admin/ruleEngine.store",
    "@/store/admin/ruleField.store",
